import React from 'react';
import './TestsMenu.css';

import { connect } from 'react-redux';

class TestsMenu extends React.Component {
    constructor ( props ) {
        super ( props );
        this.state = {
            testsList : [
                "5 клас Аднародныя члены сказа",
                "5 клас Гукі мовы",
                "6 клас Дзеяслоў",
                "7 клас Дзеепрыметнік",
                "7 клас Правапіс прыслоўяў",
                "9 клас Кантрольная тэставая работа (на 2 вар.)",
                "9 клас Пунктуацыя",
                "9 клас Складаныя сказы",
                "9 клас Сінтаксіс 5 зад-яў",
                "9 клас Тэст+адказы",
                "10 клас тест",
                "10 КЛАС Тэст па беларускай мове",
                "10 клас Тэст фанетыка",
                "11 клас Тэст",
                "11клас Правапіс прыст",
                "АД ТЭСТ  варыянт 2",
                "Варыянт",
                "Варыянт 1",
                "Варыянт 2",
                "Варыянт 3",
                "Літаратура Адам Міцкевіч",
                "Літаратура Алесь Гарун",
                "Літаратура Андрэй Макаёнак",
                "Літаратура Аркадзь Куляшоў",
                "Літаратура Беларуская літаратура першай паловы XX стагоддзя",
                "Літаратура Вінцэнт Дунін-Марцінкевіч",
                "Літаратура Георгій Марчук",
                "Літаратура З літаратуры Сярэнявечча",
                "Літаратура З літаратуры эпохі Адраджэння",
                'Літаратура Змітрок Бядуля',
                "Літаратура Кандрат Крапіва",
                "Літаратура Кастусь Каліноўскі",
                'Літаратура Ля вытокаў мастацтва слова.html',
                "Літаратура Максiм Багдановіч",
                "Літаратура Максiм Гарэцкi",
                "Літаратура Максім Танк",
                "Літаратура Міфалогія",
                "Літаратура Міхась Стральцоў",
                "Літаратура Ніл Гілевіч",
                "Літаратура Пiмен Панчанка",
                "Літаратура Пятрусь Броўка",
                "Літаратура Рыгор Барадулін",
                "Літаратура Скарына, Будны, Цяпінскі",
                "Літаратура Уладзімір Караткевіч",
                "Літаратура Францішак Багушэвіч",
                "Літаратура Энеіда навыварат",
                "Літаратура Ядвігін Ш.",
                "Літаратура Якуб Колас",
                "Літаратура Ян Баршчэўскі",
                "Літаратура Янка Брыль",
                "Літаратура Яўгенія Янішчыц",
                "Літаратура Іван Мележ",
                "Літаратура Іван Навуменка",
                "Літаратура Іван Чыгрынаў",
                "Літаратура Іван Шамякін",
                "ТЭСТ ",
                "Тэст 11 клас(агульны)",
                "ТЭСТ 11 КЛАС 1 варыянт",
                "ТЭСТАВЫЯ ЗАДАННІ",
                "Тэставыя заданні 11 клас",
                "ТЭСТ варыянт 1",
                "ТЭСТ ПА БЕАРУСКАЙ МОВЕ 11 КЛАС",
                "Тэсты 11 кл",
                "ЧАСТКА В"
            ]
        }
    }
    genTestsList() {
        let list = [];
        this.state.testsList.forEach( el => {
            list.push(
                <li>
                    <a 
                    className = "TestsMenu_el"
                    onClick = { () => this.props.ShowPDF( 'tests/lang', el ) }>{ el }</a>
                </li>               
            )
        });
        return list;
    }
    render() {
        return (
            <div className = "TestsMenu">
                <ul className = "TESTS_older">
                { this.genTestsList() }
                </ul>                
                <button
                    className = "TestsMenu_but"
                    onClick = { ()=> this.props.BackToMainMenu() }>
                    Вярнуцца да галоўнага меню
                </button>
            </div>
        )
    }
}

const mapState = ( state ) => {

}
const mapDispatch = dispatch => {
    return {
         ShowPDF : ( sub, ff ) => dispatch({ type : "SHOW_PDF", sub: sub, fileName : ff, owner: 'TestsMenu'}),
         BackToMainMenu : () => dispatch ({ type : "MAIN_MENU"})        
    }
}

export default connect(mapState, mapDispatch) (TestsMenu);