import React from 'react';
import "./AuthorCard.css";

import { connect } from 'react-redux';

class AuthorCard extends React.Component {
    constructor (props) {
        super();        
        this.state = {
            authorsData :[
                {
                    "Tag" :"Kolas",
                    "Name" : "Якуб Колас",
                    "RealName" : "Канстанцін Міхайлавіч Міцкевіч",
                    "Birth" : "22 октября (3 ноября) 1882 ",
                    "Die" : "13 августа 1956",
                    "Photo" : ["1","2", "3", "4"],
                    "Video" : "1",
                    "Bio" : `Якуб Колас (сапр. Канстанцін Міхайлавіч Міцкевіч) нарадзіўся 3 лістапада 1882 г. (па новым стылі) у засценку Акінчыцы Менскага павета Менскай губерні (цяпер у межах горада Стоўбцы Мінскай вобласці), ахрышчаны ў праваслаўнай царкве. Бацькі — Міхал Міцкевіч і Ганна Лёсік паходзілі з сялян вёскі Мікалаеўшчына (12 км ад Стоўбцаў). З 13 дзяцей, якія нарадзіліся ў іх сям'і, да сталых гадоў дажылі 9. Бацька служыў лесніком у князя Радзівіла, маці вяла хатнюю гаспадарку. У хуткім часе пасля нараджэння Костуся (так хлопчыка звалі дома) сям'я пераехала ва ўрочышча Ласток (іншая назва — Сухошчына). У 1890—1904 гг. сям'я Міцкевічаў жыла ў леснічоўцы Альбуць недалёка ад Мікалаеўшчыны.
                    Жыццё ў Альбуці, маляўнічыя навакольныя краявіды, цікавыя апавяданні розных падарожных, якія, як успамінаў пазней пісьменнік, раскрывалі яму новы свет разуменняў і ўяўленняў, пакінулі значны след у душы юнага Костуся. Слухаў ён і беларускія песні, якія спявала маці. Вялікі аўтарытэт меў у падлетка дзядзька па бацьку — Антось, які першы абудзіў цікавасць да літаратуры. Костусь сам навучыўся рускай грамаце. Дзве зімы ён разам са старэйшымі братамі вучыўся дома ў так званага "дарэктара" (хлапчука, які скончыў народную школу), потым скончыў народнае вучылішча ў Мікалаеўшчыне (1892—1894 гг.). У 1895—1897 гг. Канстанцін Міцкевіч жыў у Альбуці, дапамагаў бацькам па гаспадарцы і адначасова рыхтаваўся да паступлення ў Настаўніцкую семінарыю, шмат чытаў. Прыкладна ў 10-гадовым узросце пад уплывам твораў Івана Крылова Костусь склаў байку "Варона і Лісіца". У 12 гадоў напісаў свой першы верш "Вясна", за што атрымаў ад бацькі срэбраны рубель. У той жа час юны Міцкевіч упершыню пазнаёміўся з беларускай літаратурнай творчасцю (верш Янкі Лучыны "Стары ляснік"), і гэта зрабіла на яго моцнае ўражанне.  
                     У 1898 г. паступіў "на казённы кошт" у Нясвіжскую Настаўніцкую Семінарыю, якую скончыў у 1902 г. У час вучобы захапляўся мастацкай літаратурай: чытаў творы А. Пушкіна, М. Лермантава, М. Гогаля, А. Кальцова, М. Някрасава, Л. Талстога, І. Хемніцара, Т. Шаўчэнкі, І. Франко, А. Міцкевіча. Складаў вершы і байкі на рускай мове, збіраў матэрыялы па беларускай этнаграфіі, запісваў вусную народную творчасць. У гэты ж час пачаў ствараць вершы і празаічныя творы на беларускай мове. Складаў вершы аб прыродзе, нялёгкім існаванні селяніна, напісаў паэмы "Каля кастра" і "Страх", тэксты якіх не захаваліся, а таксама першы празаічны твор — этнаграфічны нарыс "Наша сяло, людзі і што робіцца ў сяле". 	
                      Вельмі паўплываў на будучага паэта выкладчык семінарыі Фядот Кудрынскі, які ўхваліў літаратурныя практыкаванні маладога Міцкевіча і звярнуў увагу на большую вартасць напісанага ім па-беларуску. "Вось дзе Ваша сапраўднае прызванне", — адзначыў  выкладчык. Гэта ў поўнай меры адпавядала памкненням самога аўтара. Ён адзначаў пазней:
                  
                     "Руская мова не можа выклікаць у такім поўным аб'ёме, калі я пішу, тых адчуванняў, тых пачуццяў і тае каларытнасці, якія ўласцівы беларускай мове, беларускім малюнкам, у якім дае беларуская мова, што з малаком маці ўвайшла ў маю натуру".   
                 
                      На першае дзесяцігоддзе XX ст. прыпадае пачатак працоўнай дзейнасці і першыя праявы грамадскай актыўнасці К. Міцкевіча, жанравы дыяпазон яго літаратурных твораў пашыраецца, яны робяцца больш дасканалымі, тады ж з'яўляюцца і першыя публікацыі.  
                      Пасля заканчэння семінарыі ў 1902—1905 гг. малады настаўнік працаваў на Палессі ў вёсках Люсіна (цяпер Ганцавіцкі раён), Пінкавічы (цяпер Пінскі раён). Рабіў этнаграфічныя запісы, збіраў беларускі фальклор. У гэты ж час ён пазнаёміўся з нелегальнай рэвалюцыйнай літаратурай, праводзіў растлумачальныя гутаркі з сялянамі. Якуб Колас пазней пісаў:
                 
                     "У 1905 годзе я хоць і не мог яшчэ добра арыентавацца ў партыях, але быў ужо заўзятым ворагам самадзяржаўя і ў гэтым кірунку вёў работу".
                 
                    Так, у лістападзе 1905 г. ён склаў петыцыю жыхароў Пінкавіч да памешчыка Скірмунта з патрабаваннем забяспечыць права сялян на карыстанне азёрамі і ўчасткам зямлі для пашы. Менскі губернатар прадпісаў паліцыі праверыць звесткі аб "узбуджэнні настаўнікам с. Пінкавічы Міцкевічам сялян...". У студзені 1906 г. у парадку пакарання за грамадскую дзейнасць К. Міцкевіча перавялі ў Верхменскае народнае вучылішча (цяпер Смалявіцкі раён). 9—10 ліпеня 1906 г. ён прыняў актыўны ўдзел у нелегальным настаўніцкім з'ездзе, які адбыўся ў вёсцы Мікалаеўшчына. На гэтым сходзе было пастаўлена пытанне аб неабходнасці рэарганізацыі народнай асветы на аснове дэмакратыі і дэцэнтралізацыі. З'езд разагнала паліцыя, К. Міцкевіч у ліку іншых быў пазбаўлены права працаваць настаўнікам.  
                      1 верасня 1906 г. у віленскай беларускамоўнай газеце "Наша доля" з'явіўся верш — "Наш родны край", у якім аўтар называў родную зямлю "беднай старонкай", "забытым Богам краем". Гэта першы надрукаваны твор паэта. Тут упершыню быў выкарыстаны псеўданім Якуб Колас (надалей ужываліся таксама псеўданімы Тарас Гушча, Карусь Лапаць, К. Адзінокі, К. Альбуцкі, Андрэй "сацыяліст", Тамаш Булава, Ганна Груд, Мікалаевец, Лесавік і іншыя).  
                      15 верасня 1906 г. у "Нашай долі" пад псеўданімам Дзядзька Карусь змешчана апавяданне "Слабода" пра самавольства царскай паліцыі — першы надрукаваны празаічны твор пісьменніка. У той жа час ён пачынае актыўна супрацоўнічаць у якасці аўтара з віленскай беларускамоўнай газетай "Наша ніва". У творчасці Якуба Коласа гэтага перыяду з'яўляюцца новыя формы. Ён выходзіць на больш высокі ўзровень літаратурнай працы — пачынае пісаць алегарычныя апавяданні "Казкі жыцця", дзе па-філасофску асэнсоўвае рэчаіснасць.  
                     Зіму 1906—1907 гг. Колас жыў у родных у леснічоўцы Смалярня, дзе без афіцыйнага дазволу адкрыў прыватную школу. Пачаў складаць навучальны дапаможнік "Другое чытанне для дзяцей беларусаў". У 1907 г. прыехаў у Вільню, некалькі тыдняў працаваў загадчыкам літаратурнага аддзела ў "Нашай ніве", але паводле загаду паліцыі быў вымушаны пакінуць горад. У пачатку 1908 г. некаторы час выкладаў у прыватнай школе ў вёсцы Сані (цяпер Талачынскі раён). 15 верасня 1908 г. Якуб Колас засуджаны на 3 гады турэмнага зняволення паводле абвінавачання ў актыўных дзеяннях, накіраваных на выкананне праграмы Усерасійскага саюза настаўнікаў, які, як было заяўлена на судзе, меў на мэце ліквідацыю існуючага ў Расійскай імперыі грамадскага ладу (у тым ліку ў складанні адозвы да настаўнікаў, хоць пісаў яе іншы чалавек, якога Колас суду не назваў). Увесь тэрмін пакарання Якуб Колас адбываў у Менскім астрозе. 
                     За турэмнымі кратамі ўдавалася пісаць вершы і перапраўляць на волю. У многіх творах Коласа выразна гучаць матывы вызвалення ад сацыяльнага і нацыянальнага прыгнёту.
                       У 1910-я гг. ён у сваёй творчасці звяртаецца да буйных літаратурных форм з філасофскім асэнсаваннем рэчаіснасці — пачынае працу над ліра-эпічнымі паэмамі "Новая зямля" і "Сымон-музыка".  
                       Напісаныя ў гэты перыяд вершы і апавяданні друкаваліся ў газеце "Наша ніва". У 1909 г. у Санкт-Пецярбургу ў выдавецтве "Загляне сонца і ў наша аконца" выйшла першая яго кніга "Другое чытанне для дзяцей беларусаў", змест якой складалі вершаваныя і празаічныя творы пра з'явы прыроды, байкі і казкі пра жывёл, вершы і апавяданні на маральна-этычныя тэмы, а таксама прысвечаныя нялёгкай долі селяніна. У 1910 г. у Вільні надрукаваны першы зборнік вершаў "Песні жальбы" (напісаны ў 1906—1909 гг.), дзе паэтызуецца вобраз беларуса-селяніна, які, нягледзячы на цяжкія сацыяльныя ўмовы, верыць у адраджэнне роднага краю, апавядае пра свой бяспраўны лёс, але пры гэтым мае пачуццё ўласнай годнасці, выказвае імкненне да лепшае долі.
                    Пасля выхаду з турмы з верасня 1911 г. па 1914 г. Якуб Колас займаўся настаўніцкай працай: некалькі месяцаў без афіцыйнага дазволу навучаў дзяцей чыгуначнікаў у мястэчку Лунінец, у 1912—1914 гг. пасля атрымання пасведчання аб дабранадзейнасці працаваў настаўнікам спачатку ў вёсцы Купяцічы недалёка ад Пінска, потым у Пінскім 3-м прыходскім вучылішчы. Гэты час вельмі адметны для асабістага жыцця Якуба Коласа. У жніўні 1912 г. на хутары Смольня, каля вёскі Мікалаеўшчына, адбылася яго першая сустрэча з Янкам Купалам, якая паклала пачатак іх сяброўству. У чэрвені 1913 г. Канстанцін Міцкевіч узяў шлюб з настаўніцай пінскай чыгуначнай школы Марыяй Каменскай, з якой яны пражылі разам больш за 30 гадоў, мелі трох сыноў (Даніла, Юрка і Міхась).
                 
                      У той час у газеце "Наша ніва" рэгулярна друкаваліся вершы Якуба Коласа, прысвечаныя пераважна розным аспектам жыцця беларускай вёскі. У 1912 г. у Вільні выходзіць яго зборнік "Апавяданні", у 1913 г. у Санкт-Пецярбургу асобнымі выданнямі апавяданні "Нёманаў дар", "Тоўстае палена", зборнік вершаваных апавяданняў "Прапаў чалавек". Галоўная тэма гэтых твораў — жыццё беларускага сялянства, адпаведна галоўны герой — жыхар вёскі з яго клопатамі, звычаямі, норавамі, у іх аўтар ад апісання сялянскага побыту пераходзіў да стварэння разнастайных і глыбокіх вобразаў сялян. У Вільні ў 1914 г. Беларускім Выдавецкім Таварыствам выдадзены зборнік апавяданняў шырокага тэматычнага дыяпазону "Родныя з'явы". Празаічныя творы Якуба Коласа таго перыяду па сваёй тэматыцы, ідэйнай накіраванасці, вобразнай структуры збліжаліся з яго паэзіяй. У 1916 г. у Петраградзе ў выдавецтве "Загляне сонца і ў наша аконца" надрукаваны і драматургічны твор пісьменніка — невялікая п'еса "Чарка ўсё на свеце робіць", якая мела падзагаловак "Трагедыя з нядаўніх год (з вясковага жыцця)."
                     Падчас Першай Сусветнай Вайны ў 1915 г. у сувязі з набліжэннем фронту Якуб Колас разам з сям'ёй эвакуіраваўся ў Маскоўскую губерню, дзе быў мабілізаваны на вайсковую службу. Пасля заканчэння Аляксандраўскага ваеннага вучылішча (Масква, 1916 г.) служыў у запасным палку ў г. Перм. Летам 1917 г. у званні падпаручніка накіраваны на Румынскі фронт, але ў хуткім часе ў сувязі з хваробай атрымаў адпачынак і паехаў да сям'і ў горад Абаянь (цяпер Курская вобласць Расіі). Як настаўнік быў вызвалены ад вайсковай службы і працаваў выкладчыкам, школьным інструктарам у г. Абаяні і яго наваколлі.
                      У вершах гэтага перыяду гучаць антываенныя матывы, трывога паэта за лёс Беларусі ў новых гістарычных акалічнасцях, якія склаліся ў выніку вайны і Кастрычніцкай рэвалюцыі 1917 г., і адначасова заклік да стваральнай працы на карысць роднага краю (зборнік вершаў "Водгулле", выдадзены ў Мінску ў 1922 г.).
                      Таксама Якуб Колас працягваў працу над тэкстамі паэм "Новая зямля" і "Сымон-музыка", спрабаваў свае сілы і ў галіне драматургіі. Адзін з твораў гэтага жанру — п'еса "Антось Лата" (1917 г., упершыню пастаўлена ў 1918 г. у Мінску), дзе аўтар паказаў трагічны лёс селяніна, які меў калісьці сваю гаспадарку, але, страціўшы зямлю і ўсякія сродкі існавання, ператварыўся ў чалавека "дна". Пераломны гістарычны перыяд — ад Лютаўскай рэвалюцыі да Кастрычніцкай 1917 г., роздум Якуба Коласа над далейшым лёсам Беларусі адлюстраваны ў п'есе "На дарозе жыцьця" (1917 г., пастаўлена ў Мінску ў 1921 г.).
                    Першая палова 1920-х гг. — вельмі плённы час у жыцці Якуба Коласа, яго службовай і літаратурнай дзейнасці. У 1921 г. Якуб Колас вярнуўся ў Мінск. Быў супрацоўнікам Навукова-тэрміналагічнай камісіі Народнага камісарыята асветы,  літаратурнай камісіі па збіранні вуснай народнай творчасці Інстытута Беларускай Культуры, выкладаў у Беларускім педагагічным тэхнікуме, чытаў лекцыі па граматыцы і методыцы выкладання беларускай мовы на настаўніцкіх педагагічных курсах у Слуцку, працаваў выкладчыкам беларускай мовы ў Беларускім Дзяржаўным Унівэрсітэце.  	
                       У 1921 г. у Коўне выйшаў зборнік апавяданняў "Казкі жыцця" (большасць "Казак жыцця" створаны да 1917 г., але працу над цыклам аўтар працягваў і надалей). У гэтых творах у алегарычнай форме выкладзены погляды на гісторыю і жыццёвую філасофію беларусаў як нацыі, іх месца сярод народаў-суседзяў, закрануты важныя сацыяльна-палітычныя і маральна-этычныя праблемы, паказана імкненне чалавека да пазнання таямніц прыроды і быцця.  
                       У першай палове 1920-х гг. Якуб Колас завяршае вялікія творы, задуманыя яшчэ за дзесяць гадоў да таго, у якіх намаляваў шырокую карціну жыцця беларусаў у канцы XIX — пачатку XX ст., выклаў сваё бачанне шляхоў развіцця нацыі.  
                       У 1923 г. у Мінску выйшла асобным выданнем паэма "Новая зямля". Гэты твор з'яўляецца мастацкай энцыклапедыяй жыцця беларускага сялянства на рубяжы стагоддзяў. У паэме Колас па-філасофску асэнсоўвае цэлую эпоху ў жыцці беларускага народа. Аўтар апаэтызаваў духоўнае багацце і маральную веліч працоўнага чалавека, яго адвечную мару быць гаспадаром на ўласнай зямлі. У творы яскрава апісаны побыт народа, выведзены тыповыя беларускія характары. Цудоўныя замалёўкі беларускай прыроды характарызуюць Якуба Коласа як выдатнага майстра пейзажу.  
                       У 1925 г. у часопісе "Полымя" апублікавана трэцяя рэдакцыя паэмы "Сымон-музыка". У гэтым творы асвятляецца роля мастака і мастацтва ў жыцці народа, тут найбольш поўна выявіліся эстэтычныя погляды Якуба Коласа. Гэта твор аб народных вытоках мастацтва, лёсе таленту з народа, духоўным адраджэнні нацыі. Трагічныя і драматычныя матывы ў ім пераплятаюцца з жыццясцвярджальнымі і аптымістычнымі. Аўтар стварае вобраз маладога беларуса — свядомага творцы свайго лёсу, які імкнецца да духоўнага адраджэння роднага краю. Паэт асвятляе своеасаблівасць нацыянальнага шляху беларусаў, выказвае надзею на актывізацыю духоўна-творчых сілаў народа. 
                      У гэты перыяд пашыраецца тэматыка твораў Якуба Коласа. Ён прыходзіць да апісання жыццёвых шляхоў беларускай інтэлігенцыі пачатку XX ст., яе духоўных пошукаў. Пісьменнік стварае так званыя палескія аповесці: два вялікія празаічныя творы "У палескай глушы" (выдана ў Вільні ў 1923 г.) і "У глыбі Палесся" (выдана ў Менску ў 1927 г.). Яны пазней увайшлі як 1-я і 2-я часткі ў трылогію "На ростанях" — найбольшы празаічны твор Якуба Коласа. У 1925 г. была апублікавана п'еса "Забастоўшчыкі", пра тое, як беларускае настаўніцтва ўключалася ў палітычную барацьбу. У аснове сюжэту — першы нелегальны з'езд настаўнікаў у Мікалаеўшчыне. Гэты твор не атрымаў сцэнічнага ўвасаблення. Акрамя таго, у 1925 г. напісана аповесць "На прасторах жыцця" (выдадзена ў 1926 г.), прысвечаная моладзі 1920-х гг., праблемам яе духоўнага станаўлення, адукацыі, культуры, імкненню да пераўтварэння жыцця.
                       Другая палова 1920-х — 1930-я гг. гэта час актыўнай грамадскай дзейнасці Якуба Коласа, прызнання яго заслуг і пры гэтым вельмі складаны перыяд жыцця, падзеі якога адбіліся на псіхалагічным стане, негатыўна паўплывалі на ўсю далейшую творчасць пісьменніка. Яшчэ з сярэдзіны 1920-х гг. Якуб Колас трапіў у поле зроку савецкіх рэпрэсіўных органаў. У 1925 г. у яго быў праведзены вобыск, а затым і допыт у сувязі з так званай "лістападаўскай справай", якая датычылася "контррэвалюцыйнай арганізацыі" на Случчыне. У 1930-я гг. ціск на Якуба Коласа яшчэ больш узмацніўся. Расейскія камуністы адкрыта абвінавачвалі яго ў так званай "нацдэмаўшчыне", у прапагандзе ідэй бяскласавасці беларускай нацыі, знаходзілі ў творах ідэалізацыю "кулацтва", хутарской гаспадаркі, перабольшванне ролі інтэлігенцыі і г.д. У 1930 г. Якуб Колас быў змушаны публічна "каяцца" ў палітычных "памылках". Былі арыштаваны і рэпрэсіраваны блізкія сваякі паэта — дзядзька па матчынай лініі грамадскі і палітычны дзеяч, мовазнавец Язэп Лёсік, родны брат жонкі Коласа Аляксандр Каменскі. Якубу Коласу пагражаў арышт, аднак санкцыя на яго ад вышэйшага кіраўніцтва не была дадзена. Магчыма, з-за шырокай вядомасці і народнага прызнання песняра. 
                      У 1926 г. Якуб Колас пачаў пісаць паэму "На шляхах волі" аб цяжкіх умовах існавання падчас Першай Сусветнай Вайны, іх уплыве на фарміраванне пратэстных настрояў народных мас і станоўчага стаўлення да бальшавікоў у перыяд рэвалюцый 1917 г. Над гэтым творам паэт шмат разважаў, працаваў і ў 1930-я і ў 1950-я гг., але так і не завяршыў. У творчасці  Коласа 1930-х гг. прысутнічае і тэма "калектывізацыі". Галоўны герой яго аповесці "Адшчапенец" (1930-1931 гг., выдадзена ў 1932 г.) пасля доўгіх ваганняў прыходзіць да высновы аб перавагах калектыўнай гаспадаркі перад аднаасобнай. Акрамя таго, у гэты перыяд Якуб Колас звярнуўся да драматычных падзей Першай Сусветнай Вайны галоўным чынам праз паказ "салдацкай праўды" — у п'есе "Вайна вайне" (1927-1931 гг., апошняя рэдакцыя 1938 г.) і грамадзянскай вайны — у аповесці "Дрыгва" (1933 г.) і створанай на яе аснове п'есе "У пушчах Палесся" (1937 г.). У 1940 г. пачаў пісаць паэму "Рыбакова хата" пра жыццё працоўных Заходняй Беларусі ў складзе Польскай дзяржавы, іх барацьбу за свае правы. У гэты перыяд Колас плённа працаваў у галіне перакладу з рускай, украінскай, польскай моваў ("Палтава" А. Пушкіна, некаторыя творы М. Лермантава, А. Міцкевіча, Т. Шаўчэнкі, П. Тычыны, Р. Тагора і інш.).  
                       У час нямецка-савецкае вайны паэт жыў пад Масквой у Клязьме, Ташкенце, Маскве. У вершах (зборнікі "Адпомсцім", 1942 г.; "Голас зямлі", 1943 г.), паэмах "Суд у лесе" (1942 г.), "Адплата" (1943-1944 гг.), публіцыстычных артыкулах перыяду вайны ён услаўляў патрыятызм, гераізм людзей, выкрываў чалавеканенавісніцкую сутнасць фашызму. У канцы 1944 г. вярнуўся ў Менск.  
                     Пасля вайны, з сярэдзіны 1940-х гг. і да канца жыцця Якуб Колас працаваў у Акадэміі Навук Беларусі, быў вядомы як грамадскі дзеяч. У Якуба Коласа заўсёды знаходзілі водгук праблемы асобных грамадзян, паслядоўна адстойваў ён інтарэсы і ўсёй беларускай нацыі. У 1956 г. пісьменнік напісаў ліст у вышэйшыя партыйныя інстанцыі, у якім выказаў занепакоенасць становішчам беларускай мовы ў грамадскім жыцці, прапанаваў меры па яе абароне.
                       У 1954 г. была завершана аповесць "На ростанях", у якой апісаны падзеі 1906-1911 гг. Яна стала 3-й, апошняй (разам з дзвюма папярэднімі — "У палескай глушы", "У глыбі Палесся"), часткай аднайменнай трылогіі. Трылогія — адзін з першых беларускіх раманаў.  Гэта шырокае мастацкае палатно сацыяльна-грамадскай сітуацыі ў Беларусі, эпапея жыцця беларускага народа перыяду Рэвалюцыі 1905-1907 гг. і паслярэвалюцыйных гадоў. Твор напісаны на аўтабіяграфічным матэрыяле, у ім створана галерэя партрэтаў нацыянальнай інтэлігенцыі, выхадцаў з народа, адраджэнцаў, адлюстраваны побыт сялянства і іншых сацыяльных слаёў. Аўтар выявіў глыбокае майстэрства псіхалагічнага аналізу ў апісанні сваіх герояў. У трылогіі раскрылася і майстэрства Коласа-пейзажыста: створаны цудоўныя малюнкі беларускае прыроды.  
                 
                      13 жніўня 1956 г. Якуб Колас памёр за сваім рабочым сталом. Пахаваны ў Мінску на Вайсковых Могілках.
                 
                      Шлях, які прайшоў Якуб Колас, — адметны. Асноватворныя ўласцівасьці яго жыцця і дзейнасці — сумленнасць, высокароднасць, нераўнадушша,  імкненне дапамагчы ў цяжкіх абставінах, грунтоўнасць ва ўсіх жыццёвых праявах, вернасць сваім прынцыпам, адстойванне ў прамым ці ўскосным выглядзе ўласных поглядаў, любоў да Бацькаўшчыны і яе народа, клопат аб захаванні нацыянальнай самабытнасці беларусаў, аб беларускай мове, пратэст супраць рознага кшталту прыгнечання чалавека. Гэтыя якасці ў поўнай меры адбіліся на творчасці пісьменьніка, які ўнёс значны ўклад у нацыянальную і сусветную літаратуру. Сярод творчых дасягненняў найбольш важкімі з'яўляюцца пашырэнне жанравых магчымасцяў беларускай літаратуры, выкарыстанне шырокай і актуальнай тэматыкі ў паэтычных і празаічных творах, узбагачэнне паэзіі філасофскай і пейзажнай лірыкай, спалучэнне лірыкі і эпасу, закладанне асноваў беларускага рамана і беларускай дзіцячай літаратуры, філасофскае асэнсаванне рэчаіснасці праз алегарычны аповед, станаўленне норм беларускай літаратурнай мовы.  
                       Ужо ў 1920 г. у выдадзенай у Вільні "Гісторыі беларускай літаратуры", якую напісаў вядомы беларускі пісьменнік і літаратуразнавец М. Гарэцкі, Якуб Колас названы класікам беларускай літаратуры.
                       Паэтка і перакладчык з Вялікабрытаніі В. Рыч вельмі высока ацэньвала паэму Якуба Коласа "Новая зямля". Яна параўноўвала гэты твор са старажытнарымскімі трагедыямі, з драмамі і трагедыямі Уільяма Шэкспіра. "Без такіх твораў, як "Новая зямля", - лічыла паэтэса, - сусветная літаратура была б значна бяднейшая".
                       Дзейнасць Якуба Коласа, яго роля і значэнне ў нацыянальным духоўным адраджэнні беларусаў высока ацэнены нашчадкамі.  
                       Імем Коласа названы Інстытут мовазнаўства і Цэнтральная навуковая бібліятэка Нацыянальнай Акадэміі Навук Беларусі, Нацыянальны акадэмічны драматычны тэатр у Віцебску, плошчы і вуліцы, школы і бібліятэкі ў многіх населеных пунктах Беларусі, буйное вытворчае паліграфічнае прадпрыемства ў Мінску.  
                      Творы Якуба Коласа ўвасоблены ў тэатральным, музычным, кінематаграфічным мастацтве. У тэатрах ставіліся п'есы паводле яго апавяданняў, аповесцей, трылогіі. Ю. Семянякам створана опера па паэме "Новая зямля", Ю. Багатыровым па аповесці "Дрыгва" — опера "У пушчах Палесся". На словы Якуба Коласа напісана шмат музычных твораў.  Коласаўскую паэзію для напісання песень і рамансаў выкарыстоўвалі кампазітары М. Чуркін (песні "Краска", "Вясна", рамансы "Маёй каханцы", "Гусі..."), А. Туранкоў (рамансы "Усход сонца", "Дудка", песня "Радасць"), Я. Цікоцкі (рамансы "Каманіну, Малакову, Сляпнёву", "Пераможны май") і інш. Яшчэ ў 1929 г. быў зняты фільм "Песня вясны" (рэжысёр В. Гардзін) паводле аповесці Якуба Коласа "На прасторах жыцця". У 1960-1961 гг. экранізавана трылогія "На ростанях" (фільм "Першыя выпрабаванні", рэжысёр Ул. Корш-Саблін).
                       За межамі Беларусі з творчасцю Якуба Коласа знаёмы жыхары многіх краін свету. Яго творы (пераважна паэтычныя) перакладзены больш чым на 40 замежных моў, у тым ліку на найбольш распаўсюджаныя — англійскую, нямецкую, французскую, іспанскую, кітайскую. Творчасць пісьменніка і яго ролю ў літаратуры разглядалі у сваіх працах славісты Вялікабрытаніі, Аўстрыі, Нямеччыны, Італіі. Асобае месца сярод перакладаў твораў займаюць выданні на славянскіх мовах — рускай, польскай, украінскай. На рускай мове ў розны час выходзілі тры зборы твораў Якуба Коласа.
                     Рэгулярна праводзяцца прысвечаныя творчасці паэта Міжнародныя навуковыя канфэрэнцыі, па выніках якіх выдаюцца зборнікі матэрыялаў "Каласавіны".  
                      100-гадовы юбілей беларускага песняра паводле рашэньня ЮНЭСКА адзначаўся ў міжнародным маштабе. У 1996 г. створаны Міжнародны фонд Якуба Коласа. У 2007 г. у Беларусі адзначалася 125-годдзе з дня нараджэння нацыянальнага паэта Якуба Коласа.`
                },
                {
                    "Tag" :"Kupala",
                    "Name" : "Name0",
                    "RealName" : "I",
                    "Birth" : "10.10.2010",
                    "Die" : "10.10.2010",
                    "Photo" : ["1","2", "3", "4"],
                    "Video" : "1",
                    "Bio" : "ddddd"
                },
                {
                    "Tag" :"Bikov",
                    "Name" : "Name0",
                    "RealName" : "I",
                    "Birth" : "10.10.2010",
                    "Die" : "10.10.2010",
                    "Photo" : ["1","2", "3", "4"],
                    "Video" : "1",
                    "Bio" : "ddddd"
                },
                {
                    "Tag" :"Melez",
                    "Name" : "Name0",
                    "RealName" : "I",
                    "Birth" : "10.10.2010",
                    "Die" : "10.10.2010",
                    "Photo" : ["1","2", "3", "4"],
                    "Video" : "1",
                    "Bio" : "ddddd"
                },
                {
                    "Tag" :"Baradulin",
                    "Name" : "Name0",
                    "RealName" : "I",
                    "Birth" : "10.10.2010",
                    "Die" : "10.10.2010",
                    "Photo" : ["1","2", "3", "4"],
                    "Video" : "1",
                    "Bio" : "ddddd"
                }
            ]
        }
    }
    render() {
        return (
            <div className = "AuthorCard">
                <p className = "AuthorCard_header">{"Імя :" + this.state.authorsData[this.props.AuthorNum].Name }</p>
                <p className = "AuthorCard_Birth">{ "Нарадзіўся "+this.state.authorsData[this.props.AuthorNum].Birth }</p>
                <p className = "AuthorCard_Die">{ "Памёр "+this.state.authorsData[this.props.AuthorNum].Die }</p>
                <p className = "AuthorCard_Real">{ "Сапраўднае імя:" +this.state.authorsData[this.props.AuthorNum].RealName }</p>                
                <div className = "AuthorCard_Bio">{ this.state.authorsData[this.props.AuthorNum].Bio }</div>
                <div 
                    className = "AuthorCard_photo">
                        <img
                            className = "AuthorCard_photo_img"
                            src = {"/author/"+this.state.authorsData[this.props.AuthorNum].Tag+"/photo/1.jpg"}>
                        </img>
                        <button 
                            className = "AuthorCard_photo_but"
                            onClick = { ()=> this.props.ShowSlideShow( 
                                    this.state.authorsData[this.props.AuthorNum].Photo,
                                    this.state.authorsData[this.props.AuthorNum].Tag
                            )}>Усе фота</button>
                    </div>
                <video
                    className = "AuthorCard_video"
                    width = "200px"
                    height = "150px" 
                    src = {"/author/"+this.state.authorsData[this.props.AuthorNum].Tag +"/video/1.webm"}
                    controls/>
            <p>{ this.state.authorsData[this.props.AuthorNum].bio}</p>

                <button
                    className = "AuthorCard_back"
                    onClick = { ()=> this.props.BackToMainMenu() }>
                    Вярнуцца да галоўнага меню
                </button>
            </div>
        )
    }
}


const mapState = ( state ) => ({
    AuthorNum : state.numb
})
const mapDispatch = dispatch => {
    return {       
        BackToMainMenu : () => dispatch ({ type : "MAIN_MENU"}),    
        ShowSlideShow : (arr, tag) => dispatch ({ type : "SHOW_SLIDESHOW", photoArr : arr, Tag : tag}) 
    }
}

export default connect(mapState, mapDispatch) (AuthorCard);