import React from 'react';
import "./AuthorCard.css";

import { connect } from 'react-redux';

class AuthorCard extends React.Component {
    constructor (props) {
        super();        
        this.state = {
            authorsData :[
                {
                    "Tag" :"Kolas",
                    "Name" : "Якуб Колас",
                    "RealName" : "Канстанцін Міхайлавіч Міцкевіч",
                    "Birth" : "22 кастрычніка (3 лістапада) 1882 ",
                    "Die" : "13 жніўня 1956",
                    "Photo" : ["1","2", "3", "4","5", "6", "7", "8"],
                    "Video" : "1",
                    "Bio" : `Якуб Колас (сапр. Канстанцін Міхайлавіч Міцкевіч) нарадзіўся 3 лістапада 1882 г. (па новым стылі) у засценку Акінчыцы Менскага павета Менскай губерні (цяпер у межах горада Стоўбцы Мінскай вобласці), ахрышчаны ў праваслаўнай царкве. Бацькі — Міхал Міцкевіч і Ганна Лёсік паходзілі з сялян вёскі Мікалаеўшчына (12 км ад Стоўбцаў). З 13 дзяцей, якія нарадзіліся ў іх сям'і, да сталых гадоў дажылі 9. Бацька служыў лесніком у князя Радзівіла, маці вяла хатнюю гаспадарку. У хуткім часе пасля нараджэння Костуся (так хлопчыка звалі дома) сям'я пераехала ва ўрочышча Ласток (іншая назва — Сухошчына). У 1890—1904 гг. сям'я Міцкевічаў жыла ў леснічоўцы Альбуць недалёка ад Мікалаеўшчыны.
                    Жыццё ў Альбуці, маляўнічыя навакольныя краявіды, цікавыя апавяданні розных падарожных, якія, як успамінаў пазней пісьменнік, раскрывалі яму новы свет разуменняў і ўяўленняў, пакінулі значны след у душы юнага Костуся. Слухаў ён і беларускія песні, якія спявала маці. Вялікі аўтарытэт меў у падлетка дзядзька па бацьку — Антось, які першы абудзіў цікавасць да літаратуры. Костусь сам навучыўся рускай грамаце. Дзве зімы ён разам са старэйшымі братамі вучыўся дома ў так званага "дарэктара" (хлапчука, які скончыў народную школу), потым скончыў народнае вучылішча ў Мікалаеўшчыне (1892—1894 гг.). У 1895—1897 гг. Канстанцін Міцкевіч жыў у Альбуці, дапамагаў бацькам па гаспадарцы і адначасова рыхтаваўся да паступлення ў Настаўніцкую семінарыю, шмат чытаў. Прыкладна ў 10-гадовым узросце пад уплывам твораў Івана Крылова Костусь склаў байку "Варона і Лісіца". У 12 гадоў напісаў свой першы верш "Вясна", за што атрымаў ад бацькі срэбраны рубель. У той жа час юны Міцкевіч упершыню пазнаёміўся з беларускай літаратурнай творчасцю (верш Янкі Лучыны "Стары ляснік"), і гэта зрабіла на яго моцнае ўражанне.  
                     У 1898 г. паступіў "на казённы кошт" у Нясвіжскую Настаўніцкую Семінарыю, якую скончыў у 1902 г. У час вучобы захапляўся мастацкай літаратурай: чытаў творы А. Пушкіна, М. Лермантава, М. Гогаля, А. Кальцова, М. Някрасава, Л. Талстога, І. Хемніцара, Т. Шаўчэнкі, І. Франко, А. Міцкевіча. Складаў вершы і байкі на рускай мове, збіраў матэрыялы па беларускай этнаграфіі, запісваў вусную народную творчасць. У гэты ж час пачаў ствараць вершы і празаічныя творы на беларускай мове. Складаў вершы аб прыродзе, нялёгкім існаванні селяніна, напісаў паэмы "Каля кастра" і "Страх", тэксты якіх не захаваліся, а таксама першы празаічны твор — этнаграфічны нарыс "Наша сяло, людзі і што робіцца ў сяле". 	
                      Вельмі паўплываў на будучага паэта выкладчык семінарыі Фядот Кудрынскі, які ўхваліў літаратурныя практыкаванні маладога Міцкевіча і звярнуў увагу на большую вартасць напісанага ім па-беларуску. "Вось дзе Ваша сапраўднае прызванне", — адзначыў  выкладчык. Гэта ў поўнай меры адпавядала памкненням самога аўтара. Ён адзначаў пазней:
                  
                     "Руская мова не можа выклікаць у такім поўным аб'ёме, калі я пішу, тых адчуванняў, тых пачуццяў і тае каларытнасці, якія ўласцівы беларускай мове, беларускім малюнкам, у якім дае беларуская мова, што з малаком маці ўвайшла ў маю натуру".   
                 
                      На першае дзесяцігоддзе XX ст. прыпадае пачатак працоўнай дзейнасці і першыя праявы грамадскай актыўнасці К. Міцкевіча, жанравы дыяпазон яго літаратурных твораў пашыраецца, яны робяцца больш дасканалымі, тады ж з'яўляюцца і першыя публікацыі.  
                      Пасля заканчэння семінарыі ў 1902—1905 гг. малады настаўнік працаваў на Палессі ў вёсках Люсіна (цяпер Ганцавіцкі раён), Пінкавічы (цяпер Пінскі раён). Рабіў этнаграфічныя запісы, збіраў беларускі фальклор. У гэты ж час ён пазнаёміўся з нелегальнай рэвалюцыйнай літаратурай, праводзіў растлумачальныя гутаркі з сялянамі. Якуб Колас пазней пісаў:
                 
                     "У 1905 годзе я хоць і не мог яшчэ добра арыентавацца ў партыях, але быў ужо заўзятым ворагам самадзяржаўя і ў гэтым кірунку вёў работу".
                 
                    Так, у лістападзе 1905 г. ён склаў петыцыю жыхароў Пінкавіч да памешчыка Скірмунта з патрабаваннем забяспечыць права сялян на карыстанне азёрамі і ўчасткам зямлі для пашы. Менскі губернатар прадпісаў паліцыі праверыць звесткі аб "узбуджэнні настаўнікам с. Пінкавічы Міцкевічам сялян...". У студзені 1906 г. у парадку пакарання за грамадскую дзейнасць К. Міцкевіча перавялі ў Верхменскае народнае вучылішча (цяпер Смалявіцкі раён). 9—10 ліпеня 1906 г. ён прыняў актыўны ўдзел у нелегальным настаўніцкім з'ездзе, які адбыўся ў вёсцы Мікалаеўшчына. На гэтым сходзе было пастаўлена пытанне аб неабходнасці рэарганізацыі народнай асветы на аснове дэмакратыі і дэцэнтралізацыі. З'езд разагнала паліцыя, К. Міцкевіч у ліку іншых быў пазбаўлены права працаваць настаўнікам.  
                      1 верасня 1906 г. у віленскай беларускамоўнай газеце "Наша доля" з'явіўся верш — "Наш родны край", у якім аўтар называў родную зямлю "беднай старонкай", "забытым Богам краем". Гэта першы надрукаваны твор паэта. Тут упершыню быў выкарыстаны псеўданім Якуб Колас (надалей ужываліся таксама псеўданімы Тарас Гушча, Карусь Лапаць, К. Адзінокі, К. Альбуцкі, Андрэй "сацыяліст", Тамаш Булава, Ганна Груд, Мікалаевец, Лесавік і іншыя).  
                      15 верасня 1906 г. у "Нашай долі" пад псеўданімам Дзядзька Карусь змешчана апавяданне "Слабода" пра самавольства царскай паліцыі — першы надрукаваны празаічны твор пісьменніка. У той жа час ён пачынае актыўна супрацоўнічаць у якасці аўтара з віленскай беларускамоўнай газетай "Наша ніва". У творчасці Якуба Коласа гэтага перыяду з'яўляюцца новыя формы. Ён выходзіць на больш высокі ўзровень літаратурнай працы — пачынае пісаць алегарычныя апавяданні "Казкі жыцця", дзе па-філасофску асэнсоўвае рэчаіснасць.  
                     Зіму 1906—1907 гг. Колас жыў у родных у леснічоўцы Смалярня, дзе без афіцыйнага дазволу адкрыў прыватную школу. Пачаў складаць навучальны дапаможнік "Другое чытанне для дзяцей беларусаў". У 1907 г. прыехаў у Вільню, некалькі тыдняў працаваў загадчыкам літаратурнага аддзела ў "Нашай ніве", але паводле загаду паліцыі быў вымушаны пакінуць горад. У пачатку 1908 г. некаторы час выкладаў у прыватнай школе ў вёсцы Сані (цяпер Талачынскі раён). 15 верасня 1908 г. Якуб Колас засуджаны на 3 гады турэмнага зняволення паводле абвінавачання ў актыўных дзеяннях, накіраваных на выкананне праграмы Усерасійскага саюза настаўнікаў, які, як было заяўлена на судзе, меў на мэце ліквідацыю існуючага ў Расійскай імперыі грамадскага ладу (у тым ліку ў складанні адозвы да настаўнікаў, хоць пісаў яе іншы чалавек, якога Колас суду не назваў). Увесь тэрмін пакарання Якуб Колас адбываў у Менскім астрозе. 
                     За турэмнымі кратамі ўдавалася пісаць вершы і перапраўляць на волю. У многіх творах Коласа выразна гучаць матывы вызвалення ад сацыяльнага і нацыянальнага прыгнёту.
                       У 1910-я гг. ён у сваёй творчасці звяртаецца да буйных літаратурных форм з філасофскім асэнсаваннем рэчаіснасці — пачынае працу над ліра-эпічнымі паэмамі "Новая зямля" і "Сымон-музыка".  
                       Напісаныя ў гэты перыяд вершы і апавяданні друкаваліся ў газеце "Наша ніва". У 1909 г. у Санкт-Пецярбургу ў выдавецтве "Загляне сонца і ў наша аконца" выйшла першая яго кніга "Другое чытанне для дзяцей беларусаў", змест якой складалі вершаваныя і празаічныя творы пра з'явы прыроды, байкі і казкі пра жывёл, вершы і апавяданні на маральна-этычныя тэмы, а таксама прысвечаныя нялёгкай долі селяніна. У 1910 г. у Вільні надрукаваны першы зборнік вершаў "Песні жальбы" (напісаны ў 1906—1909 гг.), дзе паэтызуецца вобраз беларуса-селяніна, які, нягледзячы на цяжкія сацыяльныя ўмовы, верыць у адраджэнне роднага краю, апавядае пра свой бяспраўны лёс, але пры гэтым мае пачуццё ўласнай годнасці, выказвае імкненне да лепшае долі.
                    Пасля выхаду з турмы з верасня 1911 г. па 1914 г. Якуб Колас займаўся настаўніцкай працай: некалькі месяцаў без афіцыйнага дазволу навучаў дзяцей чыгуначнікаў у мястэчку Лунінец, у 1912—1914 гг. пасля атрымання пасведчання аб дабранадзейнасці працаваў настаўнікам спачатку ў вёсцы Купяцічы недалёка ад Пінска, потым у Пінскім 3-м прыходскім вучылішчы. Гэты час вельмі адметны для асабістага жыцця Якуба Коласа. У жніўні 1912 г. на хутары Смольня, каля вёскі Мікалаеўшчына, адбылася яго першая сустрэча з Янкам Купалам, якая паклала пачатак іх сяброўству. У чэрвені 1913 г. Канстанцін Міцкевіч узяў шлюб з настаўніцай пінскай чыгуначнай школы Марыяй Каменскай, з якой яны пражылі разам больш за 30 гадоў, мелі трох сыноў (Даніла, Юрка і Міхась).
                 
                      У той час у газеце "Наша ніва" рэгулярна друкаваліся вершы Якуба Коласа, прысвечаныя пераважна розным аспектам жыцця беларускай вёскі. У 1912 г. у Вільні выходзіць яго зборнік "Апавяданні", у 1913 г. у Санкт-Пецярбургу асобнымі выданнямі апавяданні "Нёманаў дар", "Тоўстае палена", зборнік вершаваных апавяданняў "Прапаў чалавек". Галоўная тэма гэтых твораў — жыццё беларускага сялянства, адпаведна галоўны герой — жыхар вёскі з яго клопатамі, звычаямі, норавамі, у іх аўтар ад апісання сялянскага побыту пераходзіў да стварэння разнастайных і глыбокіх вобразаў сялян. У Вільні ў 1914 г. Беларускім Выдавецкім Таварыствам выдадзены зборнік апавяданняў шырокага тэматычнага дыяпазону "Родныя з'явы". Празаічныя творы Якуба Коласа таго перыяду па сваёй тэматыцы, ідэйнай накіраванасці, вобразнай структуры збліжаліся з яго паэзіяй. У 1916 г. у Петраградзе ў выдавецтве "Загляне сонца і ў наша аконца" надрукаваны і драматургічны твор пісьменніка — невялікая п'еса "Чарка ўсё на свеце робіць", якая мела падзагаловак "Трагедыя з нядаўніх год (з вясковага жыцця)."
                     Падчас Першай Сусветнай Вайны ў 1915 г. у сувязі з набліжэннем фронту Якуб Колас разам з сям'ёй эвакуіраваўся ў Маскоўскую губерню, дзе быў мабілізаваны на вайсковую службу. Пасля заканчэння Аляксандраўскага ваеннага вучылішча (Масква, 1916 г.) служыў у запасным палку ў г. Перм. Летам 1917 г. у званні падпаручніка накіраваны на Румынскі фронт, але ў хуткім часе ў сувязі з хваробай атрымаў адпачынак і паехаў да сям'і ў горад Абаянь (цяпер Курская вобласць Расіі). Як настаўнік быў вызвалены ад вайсковай службы і працаваў выкладчыкам, школьным інструктарам у г. Абаяні і яго наваколлі.
                      У вершах гэтага перыяду гучаць антываенныя матывы, трывога паэта за лёс Беларусі ў новых гістарычных акалічнасцях, якія склаліся ў выніку вайны і Кастрычніцкай рэвалюцыі 1917 г., і адначасова заклік да стваральнай працы на карысць роднага краю (зборнік вершаў "Водгулле", выдадзены ў Мінску ў 1922 г.).
                      Таксама Якуб Колас працягваў працу над тэкстамі паэм "Новая зямля" і "Сымон-музыка", спрабаваў свае сілы і ў галіне драматургіі. Адзін з твораў гэтага жанру — п'еса "Антось Лата" (1917 г., упершыню пастаўлена ў 1918 г. у Мінску), дзе аўтар паказаў трагічны лёс селяніна, які меў калісьці сваю гаспадарку, але, страціўшы зямлю і ўсякія сродкі існавання, ператварыўся ў чалавека "дна". Пераломны гістарычны перыяд — ад Лютаўскай рэвалюцыі да Кастрычніцкай 1917 г., роздум Якуба Коласа над далейшым лёсам Беларусі адлюстраваны ў п'есе "На дарозе жыцьця" (1917 г., пастаўлена ў Мінску ў 1921 г.).
                    Першая палова 1920-х гг. — вельмі плённы час у жыцці Якуба Коласа, яго службовай і літаратурнай дзейнасці. У 1921 г. Якуб Колас вярнуўся ў Мінск. Быў супрацоўнікам Навукова-тэрміналагічнай камісіі Народнага камісарыята асветы,  літаратурнай камісіі па збіранні вуснай народнай творчасці Інстытута Беларускай Культуры, выкладаў у Беларускім педагагічным тэхнікуме, чытаў лекцыі па граматыцы і методыцы выкладання беларускай мовы на настаўніцкіх педагагічных курсах у Слуцку, працаваў выкладчыкам беларускай мовы ў Беларускім Дзяржаўным Унівэрсітэце.  	
                       У 1921 г. у Коўне выйшаў зборнік апавяданняў "Казкі жыцця" (большасць "Казак жыцця" створаны да 1917 г., але працу над цыклам аўтар працягваў і надалей). У гэтых творах у алегарычнай форме выкладзены погляды на гісторыю і жыццёвую філасофію беларусаў як нацыі, іх месца сярод народаў-суседзяў, закрануты важныя сацыяльна-палітычныя і маральна-этычныя праблемы, паказана імкненне чалавека да пазнання таямніц прыроды і быцця.  
                       У першай палове 1920-х гг. Якуб Колас завяршае вялікія творы, задуманыя яшчэ за дзесяць гадоў да таго, у якіх намаляваў шырокую карціну жыцця беларусаў у канцы XIX — пачатку XX ст., выклаў сваё бачанне шляхоў развіцця нацыі.  
                       У 1923 г. у Мінску выйшла асобным выданнем паэма "Новая зямля". Гэты твор з'яўляецца мастацкай энцыклапедыяй жыцця беларускага сялянства на рубяжы стагоддзяў. У паэме Колас па-філасофску асэнсоўвае цэлую эпоху ў жыцці беларускага народа. Аўтар апаэтызаваў духоўнае багацце і маральную веліч працоўнага чалавека, яго адвечную мару быць гаспадаром на ўласнай зямлі. У творы яскрава апісаны побыт народа, выведзены тыповыя беларускія характары. Цудоўныя замалёўкі беларускай прыроды характарызуюць Якуба Коласа як выдатнага майстра пейзажу.  
                       У 1925 г. у часопісе "Полымя" апублікавана трэцяя рэдакцыя паэмы "Сымон-музыка". У гэтым творы асвятляецца роля мастака і мастацтва ў жыцці народа, тут найбольш поўна выявіліся эстэтычныя погляды Якуба Коласа. Гэта твор аб народных вытоках мастацтва, лёсе таленту з народа, духоўным адраджэнні нацыі. Трагічныя і драматычныя матывы ў ім пераплятаюцца з жыццясцвярджальнымі і аптымістычнымі. Аўтар стварае вобраз маладога беларуса — свядомага творцы свайго лёсу, які імкнецца да духоўнага адраджэння роднага краю. Паэт асвятляе своеасаблівасць нацыянальнага шляху беларусаў, выказвае надзею на актывізацыю духоўна-творчых сілаў народа. 
                      У гэты перыяд пашыраецца тэматыка твораў Якуба Коласа. Ён прыходзіць да апісання жыццёвых шляхоў беларускай інтэлігенцыі пачатку XX ст., яе духоўных пошукаў. Пісьменнік стварае так званыя палескія аповесці: два вялікія празаічныя творы "У палескай глушы" (выдана ў Вільні ў 1923 г.) і "У глыбі Палесся" (выдана ў Менску ў 1927 г.). Яны пазней увайшлі як 1-я і 2-я часткі ў трылогію "На ростанях" — найбольшы празаічны твор Якуба Коласа. У 1925 г. была апублікавана п'еса "Забастоўшчыкі", пра тое, як беларускае настаўніцтва ўключалася ў палітычную барацьбу. У аснове сюжэту — першы нелегальны з'езд настаўнікаў у Мікалаеўшчыне. Гэты твор не атрымаў сцэнічнага ўвасаблення. Акрамя таго, у 1925 г. напісана аповесць "На прасторах жыцця" (выдадзена ў 1926 г.), прысвечаная моладзі 1920-х гг., праблемам яе духоўнага станаўлення, адукацыі, культуры, імкненню да пераўтварэння жыцця.
                       Другая палова 1920-х — 1930-я гг. гэта час актыўнай грамадскай дзейнасці Якуба Коласа, прызнання яго заслуг і пры гэтым вельмі складаны перыяд жыцця, падзеі якога адбіліся на псіхалагічным стане, негатыўна паўплывалі на ўсю далейшую творчасць пісьменніка. Яшчэ з сярэдзіны 1920-х гг. Якуб Колас трапіў у поле зроку савецкіх рэпрэсіўных органаў. У 1925 г. у яго быў праведзены вобыск, а затым і допыт у сувязі з так званай "лістападаўскай справай", якая датычылася "контррэвалюцыйнай арганізацыі" на Случчыне. У 1930-я гг. ціск на Якуба Коласа яшчэ больш узмацніўся. Расейскія камуністы адкрыта абвінавачвалі яго ў так званай "нацдэмаўшчыне", у прапагандзе ідэй бяскласавасці беларускай нацыі, знаходзілі ў творах ідэалізацыю "кулацтва", хутарской гаспадаркі, перабольшванне ролі інтэлігенцыі і г.д. У 1930 г. Якуб Колас быў змушаны публічна "каяцца" ў палітычных "памылках". Былі арыштаваны і рэпрэсіраваны блізкія сваякі паэта — дзядзька па матчынай лініі грамадскі і палітычны дзеяч, мовазнавец Язэп Лёсік, родны брат жонкі Коласа Аляксандр Каменскі. Якубу Коласу пагражаў арышт, аднак санкцыя на яго ад вышэйшага кіраўніцтва не была дадзена. Магчыма, з-за шырокай вядомасці і народнага прызнання песняра. 
                      У 1926 г. Якуб Колас пачаў пісаць паэму "На шляхах волі" аб цяжкіх умовах існавання падчас Першай Сусветнай Вайны, іх уплыве на фарміраванне пратэстных настрояў народных мас і станоўчага стаўлення да бальшавікоў у перыяд рэвалюцый 1917 г. Над гэтым творам паэт шмат разважаў, працаваў і ў 1930-я і ў 1950-я гг., але так і не завяршыў. У творчасці  Коласа 1930-х гг. прысутнічае і тэма "калектывізацыі". Галоўны герой яго аповесці "Адшчапенец" (1930-1931 гг., выдадзена ў 1932 г.) пасля доўгіх ваганняў прыходзіць да высновы аб перавагах калектыўнай гаспадаркі перад аднаасобнай. Акрамя таго, у гэты перыяд Якуб Колас звярнуўся да драматычных падзей Першай Сусветнай Вайны галоўным чынам праз паказ "салдацкай праўды" — у п'есе "Вайна вайне" (1927-1931 гг., апошняя рэдакцыя 1938 г.) і грамадзянскай вайны — у аповесці "Дрыгва" (1933 г.) і створанай на яе аснове п'есе "У пушчах Палесся" (1937 г.). У 1940 г. пачаў пісаць паэму "Рыбакова хата" пра жыццё працоўных Заходняй Беларусі ў складзе Польскай дзяржавы, іх барацьбу за свае правы. У гэты перыяд Колас плённа працаваў у галіне перакладу з рускай, украінскай, польскай моваў ("Палтава" А. Пушкіна, некаторыя творы М. Лермантава, А. Міцкевіча, Т. Шаўчэнкі, П. Тычыны, Р. Тагора і інш.).  
                       У час нямецка-савецкае вайны паэт жыў пад Масквой у Клязьме, Ташкенце, Маскве. У вершах (зборнікі "Адпомсцім", 1942 г.; "Голас зямлі", 1943 г.), паэмах "Суд у лесе" (1942 г.), "Адплата" (1943-1944 гг.), публіцыстычных артыкулах перыяду вайны ён услаўляў патрыятызм, гераізм людзей, выкрываў чалавеканенавісніцкую сутнасць фашызму. У канцы 1944 г. вярнуўся ў Менск.  
                     Пасля вайны, з сярэдзіны 1940-х гг. і да канца жыцця Якуб Колас працаваў у Акадэміі Навук Беларусі, быў вядомы як грамадскі дзеяч. У Якуба Коласа заўсёды знаходзілі водгук праблемы асобных грамадзян, паслядоўна адстойваў ён інтарэсы і ўсёй беларускай нацыі. У 1956 г. пісьменнік напісаў ліст у вышэйшыя партыйныя інстанцыі, у якім выказаў занепакоенасць становішчам беларускай мовы ў грамадскім жыцці, прапанаваў меры па яе абароне.
                       У 1954 г. была завершана аповесць "На ростанях", у якой апісаны падзеі 1906-1911 гг. Яна стала 3-й, апошняй (разам з дзвюма папярэднімі — "У палескай глушы", "У глыбі Палесся"), часткай аднайменнай трылогіі. Трылогія — адзін з першых беларускіх раманаў.  Гэта шырокае мастацкае палатно сацыяльна-грамадскай сітуацыі ў Беларусі, эпапея жыцця беларускага народа перыяду Рэвалюцыі 1905-1907 гг. і паслярэвалюцыйных гадоў. Твор напісаны на аўтабіяграфічным матэрыяле, у ім створана галерэя партрэтаў нацыянальнай інтэлігенцыі, выхадцаў з народа, адраджэнцаў, адлюстраваны побыт сялянства і іншых сацыяльных слаёў. Аўтар выявіў глыбокае майстэрства псіхалагічнага аналізу ў апісанні сваіх герояў. У трылогіі раскрылася і майстэрства Коласа-пейзажыста: створаны цудоўныя малюнкі беларускае прыроды.  
                 
                      13 жніўня 1956 г. Якуб Колас памёр за сваім рабочым сталом. Пахаваны ў Мінску на Вайсковых Могілках.
                 
                      Шлях, які прайшоў Якуб Колас, — адметны. Асноватворныя ўласцівасьці яго жыцця і дзейнасці — сумленнасць, высокароднасць, нераўнадушша,  імкненне дапамагчы ў цяжкіх абставінах, грунтоўнасць ва ўсіх жыццёвых праявах, вернасць сваім прынцыпам, адстойванне ў прамым ці ўскосным выглядзе ўласных поглядаў, любоў да Бацькаўшчыны і яе народа, клопат аб захаванні нацыянальнай самабытнасці беларусаў, аб беларускай мове, пратэст супраць рознага кшталту прыгнечання чалавека. Гэтыя якасці ў поўнай меры адбіліся на творчасці пісьменьніка, які ўнёс значны ўклад у нацыянальную і сусветную літаратуру. Сярод творчых дасягненняў найбольш важкімі з'яўляюцца пашырэнне жанравых магчымасцяў беларускай літаратуры, выкарыстанне шырокай і актуальнай тэматыкі ў паэтычных і празаічных творах, узбагачэнне паэзіі філасофскай і пейзажнай лірыкай, спалучэнне лірыкі і эпасу, закладанне асноваў беларускага рамана і беларускай дзіцячай літаратуры, філасофскае асэнсаванне рэчаіснасці праз алегарычны аповед, станаўленне норм беларускай літаратурнай мовы.  
                       Ужо ў 1920 г. у выдадзенай у Вільні "Гісторыі беларускай літаратуры", якую напісаў вядомы беларускі пісьменнік і літаратуразнавец М. Гарэцкі, Якуб Колас названы класікам беларускай літаратуры.
                       Паэтка і перакладчык з Вялікабрытаніі В. Рыч вельмі высока ацэньвала паэму Якуба Коласа "Новая зямля". Яна параўноўвала гэты твор са старажытнарымскімі трагедыямі, з драмамі і трагедыямі Уільяма Шэкспіра. "Без такіх твораў, як "Новая зямля", - лічыла паэтэса, - сусветная літаратура была б значна бяднейшая".
                       Дзейнасць Якуба Коласа, яго роля і значэнне ў нацыянальным духоўным адраджэнні беларусаў высока ацэнены нашчадкамі.  
                       Імем Коласа названы Інстытут мовазнаўства і Цэнтральная навуковая бібліятэка Нацыянальнай Акадэміі Навук Беларусі, Нацыянальны акадэмічны драматычны тэатр у Віцебску, плошчы і вуліцы, школы і бібліятэкі ў многіх населеных пунктах Беларусі, буйное вытворчае паліграфічнае прадпрыемства ў Мінску.  
                      Творы Якуба Коласа ўвасоблены ў тэатральным, музычным, кінематаграфічным мастацтве. У тэатрах ставіліся п'есы паводле яго апавяданняў, аповесцей, трылогіі. Ю. Семянякам створана опера па паэме "Новая зямля", Ю. Багатыровым па аповесці "Дрыгва" — опера "У пушчах Палесся". На словы Якуба Коласа напісана шмат музычных твораў.  Коласаўскую паэзію для напісання песень і рамансаў выкарыстоўвалі кампазітары М. Чуркін (песні "Краска", "Вясна", рамансы "Маёй каханцы", "Гусі..."), А. Туранкоў (рамансы "Усход сонца", "Дудка", песня "Радасць"), Я. Цікоцкі (рамансы "Каманіну, Малакову, Сляпнёву", "Пераможны май") і інш. Яшчэ ў 1929 г. быў зняты фільм "Песня вясны" (рэжысёр В. Гардзін) паводле аповесці Якуба Коласа "На прасторах жыцця". У 1960-1961 гг. экранізавана трылогія "На ростанях" (фільм "Першыя выпрабаванні", рэжысёр Ул. Корш-Саблін).
                       За межамі Беларусі з творчасцю Якуба Коласа знаёмы жыхары многіх краін свету. Яго творы (пераважна паэтычныя) перакладзены больш чым на 40 замежных моў, у тым ліку на найбольш распаўсюджаныя — англійскую, нямецкую, французскую, іспанскую, кітайскую. Творчасць пісьменніка і яго ролю ў літаратуры разглядалі у сваіх працах славісты Вялікабрытаніі, Аўстрыі, Нямеччыны, Італіі. Асобае месца сярод перакладаў твораў займаюць выданні на славянскіх мовах — рускай, польскай, украінскай. На рускай мове ў розны час выходзілі тры зборы твораў Якуба Коласа.
                     Рэгулярна праводзяцца прысвечаныя творчасці паэта Міжнародныя навуковыя канфэрэнцыі, па выніках якіх выдаюцца зборнікі матэрыялаў "Каласавіны".  
                      100-гадовы юбілей беларускага песняра паводле рашэньня ЮНЭСКА адзначаўся ў міжнародным маштабе. У 1996 г. створаны Міжнародны фонд Якуба Коласа. У 2007 г. у Беларусі адзначалася 125-годдзе з дня нараджэння нацыянальнага паэта Якуба Коласа.`
                },
                {
                    "Tag" :"Kupala",
                    "Name" : "Янка Купала",
                    "RealName" : "Іван Дамінікавіч Луцэвіч",
                    "Birth" : "25 чэрвеня (7 ліпеня) 1882",
                    "Die" : "28 чэрвеня 1942",
                    "Photo" : ["1","2", "3", "4", "5", "6", "7", "8"],
                    "Video" : "1",
                    "Bio" : `Янка Купала - класік сусветнай і беларускай літаратуры, адзін з заснавальнікаў новай беларускай літаратуры і сучаснай беларускай літаратурнай мовы, народны паэт Беларусі, духоўны лідэр беларускага нацыянальнага адраджэння. Выступаў як паэт, драматург, публіцыст, перакладчык, грамадскі дзеяч.

                    Сапраўднае імя Янкі Купалы (зарэгістраванае ў афіцыйных дакументах аб нараджэнні) - Іван Дамінікавіч Луцэвіч. Ён нарадзіўся 7 ліпеня 1882 г. (па новым стылі) у фальварку Вязынка Мінскага павета Мінскай губерні (цяпер вёска Вязынка Маладзечанскага раёна Мінскай вобласці). Бацькі - Дамінік Ануфрыевіч і Бянігна Іванаўна - паходзілі з дробнай чыншавай шляхты, якая мела свае адметныя саслоўныя рысы, але па эканамічным становішчы і ладзе жыцця была блізкай да сялян. Дваранскае паходжанне роду Луцэвічаў Сенатам Расійскай імперыі зацверджана не было. Тым не менш пры хрышчэнні ў Радашковіцкім касцёле Іван (для блізкіх - Ясь) Луцэвіч быў запісаны дваранінам, але пазней паводле афіцыйных дакументаў належаў да мяшчан. Матэрыяльнае становішча сям' і рэзка пагоршылася, калі Луцэвічы ў 1870-х гг. былі выселены з засценка Пяскі (называўся таксама Лазараўшчына, Луцэвічы; цяпер Уздзенскі раён Мінскай вобласці), дзе род жыў з XVII ст. (Да гэтага Луцэвічы як чыншавая шляхта хоць і не мелі спадчыннай зямлі, але валодалі сядзібай на падставе бясплатнага карыстання.) Дамініку Луцэвічу давялося арандаваць чужую зямлю. Сям'я была шматдзетнай, часта пераязджала з месца на месца. Ясь як старэйшы сын быў галоўным памочнікам бацькі па гаспадарцы.
                    
                    З дзяцінства будучага паэта цікавіў беларускі фальклор. Даволі рана ён навучыўся чытаць, імкнуўся да ведаў. Але бацькі не мелі сродкаў, каб даць сыну сістэматычную і дастаткова поўную адукацыю. Шмат што хлопчык спасцігаў шляхам актыўнай самаадукацыі. З 1888 па 1890 г. вучыўся ў вандроўных настаўнікаў, займаўся ў Сенніцкім народным вучылішчы, у прыватнай падрыхтоўчай школе ў Мінску. Толькі ў 16-гадовым узросце змог скончыць поўны курс (два класы за адзін год) Бяларуцкага народнага вучылішча.
                    
                    З 1895 да 1904 г. сям'я жыла ў засценку Селішча (цяпер у Лагойскім раёне Мінскай вобласці). Вялікі ўплыў на фарміраванне светапогляду маладога чалавека мела знаёмства з удзельнікам паўстання пад кіраўніцтвам К. Каліноўскага ўладальнікам суседняга маёнтка 3. Чаховічам. Ясь карыстаўся яго багатай бібліятэкай, дзе была і нелегальная літаратура, пераважна пра паўстанне 1863 г. Знаёмства з З. Чаховічам стала штуршком для развіцця нацыянальнай самасвядомасці юнака, абудзіла ў ім цікавасць да мінулага Беларусі.
                    
                    Пасля смерці бацькі ў 1902 г. Ясю, каб пракарміць сям'ю, давялося на працягу шасці гадоў (1902-1908 гг.) не толькі працаваць на сваёй гаспадарцы, але таксама шукаць работу ў іншых месцах. Ён быў хатнім настаўнікам, прыказчыкам у панскім маёнтку, чорнарабочым, тры гады працаваў памочнікам вінакура на броварах. Да гэтага перыяду адносяцца першыя літаратурныя спробы.
                    
                    Паэт-пачатковец шмат чытаў. Найбольш падабаліся яму кнігі тых пісьменнікаў, якія блізка стаялі да народа, пісалі аб яго жыцці і працы. Асаблівую цікавасць выклікала творчасць М. Някрасава, А. Кальцова, М. Лермантава, Т. Шаўчэнкі, А. Міцкевіча, Ю. Славацкага, М. Канапніцкай, У. Сыракомлі, Э. Ажэшкі і іншых. Пазней вялікае ўражанне на Я. Купалу зрабілі творы М. Горкага.
                    
                    Першыя вершы - сентыментальна-рамантычныя - былі напісаны па-польску (1902 г.). Але ў хуткім часе паэт усвядоміў, што толькі родная беларуская мова - тая стыхія, праз якую ён можа выказаць у поўным аб'ёме свае думкі і памкненні. Рашэнне пісаць па-беларуску ў той час было смелым крокам. Беларуская мова ўсё яшчэ знаходзілася пад забаронаю, спадзявацца на публікацыю не даводзілася. Як пісаў Я. Купала ў аўтабіяграфіі: "У 1904 г. трапляюцца мне ў рукі беларускія пракламацыі і рэвалюцыйныя брашуры на беларускай мове. Гэта канчаткова вырашыла, што я беларус і што адзінае маё прызначэнне - служыць свайму народу ўсімі сіламі сваёй душы і сэрца". Дапамагло гэта асэнсаваць і знаёмства з кнігамі беларускіх літаратараў XIX ст. Ф. Багушэвіча і В. Дуніна-Марцінкевіча.
                    
                    Найбольш ранні з вядомых твораў маладога паэта Луцэвіча, напісаных па-беларуску, - "Мая доля", датаваны 15 ліпеня 1904 г., перадае псіхалагічнае самаадчуванне чалавека з народа, яго прыгнечанасць і зададзенасць жыццёвага шляху. 15 мая 1905 г. у мінскай газеце "Северо-Западный край" быў надрукаваны верш "Мужык" - першы апублікаваны твор паэта на беларускай мове У ім закрануты тэмы чалавечай годнасці і самасцвярджэння працоўнага селяніна.
                    
                    З гэтага ж часу замест афіцыйнага імя - Іван Луцэвіч - літаратар пачаў ужываць псеўданім Янук Купала. Выбар такога літаратурнага імя звязаны з народным святам Купалля, пошукам чароўнай кветкі шчасця, што для паэта стала ўвасабленнем пошуку лепшай долі для народа, памкнення да светлай будучыні.
                    
                    11 мая 1907 г. у газеце "Наша ніва" змешчаны верш "Касцу", які стаў першым выступленнем Купалы ў беларускамоўным друку. Пасля гэтага Купала ў "Нашай ніве" друкаваўся рэгулярна. Асноўныя тэмы тагачасных вершаў - бяспраўнае становішча селяніна, прыгажосць роднай зямлі. Купала - паэт-рамантык. Разам з тым ён аддаў пэўную даніну ідэям рэвалюцыйнага абнаўлення рэчаіснасці, звязваючы ідэалы нацыянальнага адраджэння з радыкальна-рэвалюцыйнымі пераўтварэннямі.
                    
                    У гэтыя гады створаны паэмы "Зімою", "Нікому", "Калека", "Адплата кахання", заснаваныя на рэальных фактах з жыцця беларускіх сялян, якія засведчылі схільнасць іх аўтара да рамантычна яркіх, выключных герояў і сітуацый, а таксама драматычная паэма "Адвечная песня" - апафеоз мужычаму імкненню да шчасця.
                    
                    У пачатку 1908 г. у Санкт-Пецярбургу ў беларускім выдавецтве "Загляне сонца і ў наша аконца" выйшаў першы зборнік Я. Купалы - "Жалейка", дзе былі надрукаваны вершы 1905-1907 гг. і паэма "Адплата кахання". У гэтых лірычных творах у элегічнай форме выразна адлюстравана адвечная скарга селяніна на сваю цяжкую долю, выказаны памкненні народа і самога паэта як выразніка яго думак і пачуццяў. У зборніку ўпершыню апублікаваны верш "А хто там ідзе?", які адыграў значную ролю ў станаўленні беларускай нацыі, на доўгі час стаў неафіцыйным беларускім гімнам. "Жалейка" двойчы канфіскоўвалася ўладамі. З нагоды выхаду зборніка беларускі публіцыст і літаратурны крытык У. Самойла пісаў пра яго аўтара: " Сонца жывой, сапраўднай паэзіі заглянула ў ваконца цёмнай, беднай, але вялікай хаты беларускага народа! Няхай ён будзе для беларусаў тым, чым быў Шаўчэнка для Украіны!.." Рэдактарам зборніка быў выдатны дзеяч беларускай культуры, педагог, выдавец, адзін з лідэраў беларускага руху ў Санкт-Пецярбургу ў пачатку XX ст. Браніслаў Ігнатавіч Эпімах-Шыпіла - чалавек, які адыграў вельмі істотную ролю ў жыцці паэта. Цікавы факт - псеўданім аўтара зборніка Янук Купала ён памылкова напісаў як Янка Купала. І з таго часу псеўданімам менавіта ў такой форме пачаў карыстацца Іван Дамінікавіч Луцэвіч.
                    
                    У 1908-1909 гг. Янка Купала жыў у Вільні, працаваў у рэдакцыі газеты "Наша ніва" і адначасова бібліятэкарам у прыватнай бібліятэцы. У гэты час ім напісаны паэмы "У Піліпаўку" і "За што?", сюжэты якіх - трагічныя здарэнні з жыцця беларускіх сялян. У канцы 1908 г. адбылося асабістае знаёмства Янкі Купалы і Б. Эпімах-Шыпілы
                    
                    У 1909-1913 гг. Я. Купала займаўся на агульнаадукацыйных курсах А.С. Чарняева ў Санкт-Пецярбургу, якія паводле слоў паэта, далі яму "вельмі многа... сістэматызавалі хаатычныя веды", там ён вывучаў тэорыю і гісторыю літаратуры. Б. Эпімах-Шыпіла дапамог з паступленнем на курсы, аказаў значную падтрымку маладому літаратару, як духоўную, так і матэрыяльную. Увесь час навучання на курсах Купала жыў у яго кватэры. Ён пазнаёміўся з прадстаўнікамі перадавой рускай інтэлігенцыі, рэвалюцыйна настроенай моладдзю, удзельнічаў у пасяджэннях Беларускага навукова-літаратурнага гуртка - культурна-асветнай арганізацыі студэнтаў-беларусаў Санкт-Пецярбургскага універсітэта, якія доўгі час да афіцыйнай рэгістрацыі сваёй арганізацыі праводзілі пасяджэнні на кватэры Б. Эпімах-Шыпілы. Свайму апекуну Янка Купала прысвяціў верш "Прафесару Б. Эпімах-Шыпілу з Новым 1910 годам", а таксама паэму "Паляўнічы і пара галубкоў" (Легенда з індыйскай кнігі "Магабгарата"). У сваю чаргу ён выказаў яму маральную падтрымку ў вершы "Прафесару п. Б. Эпімах-Шыпілу", з падзагалоўкам "З прычыны пажару ў яго маёнтку", калі ў 1910 г. згарэў дом Б. Эпімах-Шыпілы на яго радзіме, дзе пецярбургскі руплівец трымаў вялікую калекцыю рарытэтаў для будучага беларускага музея. Б. Эпімах-Шыпіла захаваў у сваім архіве многія вершы Янкі Купалы, напісаныя ім у час вучобы ў Пецярбургу, склаў два машынапісныя сшыткі ненадрукаваных у свой час твораў паэта. Кантакты паміж імі працягваліся да канца жыцця Б. Эпімах-Шыпілы, які памёр у 1934 г. У 1910 г. з творчасцю Янкі Купалы пазнаёміўся Максім Горкі, які выказаў вялікую цікавасць да яе і шчырае захапленне. Летам 1912 г. адбылася сустрэча Янкі Купалы і Якуба Коласа. Дагэтуль яны асабіста знаёмыя не былі, хоць добра ведалі адзін аднаго па літаратурных творах. Знаёмства з часам перарасло ў сяброўства двух вялікіх майстроў слова.
                    
                    У 1910-1913 гг. былі створаны паэмы "На Куццю", "На Дзяды", "Яна і я", рамантычныя паэмы на фальклорнай аснове "Курган", "Бандароўна", "Магіла льва", драматычныя паэмы "Сон на кургане", "На папасе", дзе Купала выявіў сябе буйнейшым прадстаўніком нацыянальнага рамантызму. Ва ўсіх гэтых творах - глыбокі філасофскі роздум пра мінулае і будучыню роднага краю.
                    
                    Восенню 1910 г. выйшаў з друку другі Купалаў зборнік - "Гусляр", у якім выразна выяўлена рамантычнае светаадчуванне паэта, яго хваляванне за лёс Бацькаўшчыны. У 1913 г. быў выдадзены трэці паэтычны зборнік «Шляхам жыцця». Побач з творамі выразнай грамадзянскай, патрыятычнай накіраванасці сюды ўвайшлі шэдэўры Купалавай філасофскай, пейзажнай, інтымнай лірыкі. Ва ўсіх гэтых паэтычных выданнях Купала заклікаў народ да барацьбы за сацыяльнае і нацыянальнае вызваленне.
                    
                    Пачаў працаваць Я. Купала і ў галіне драматургіі. Ужо першыя яго вопыты ў гэтым накірунку былі вельмі паспяховамі і сталі падмуркам беларускай нацыянальнай камедыі і драмы. У камедыі "Паўлінка", сцэнічным жарце "Прымакі" высмейваюцца дамастроеўскія асновы жыцця засцянковай шляхты. Разам с тым вобразы Паўлінкі і яе каханага Якіма ўвасабляюць сабой новыя перадавыя павевы ў жыцці вёскі. У драме "Раскіданае гняздо" раскрываецца цяжкі лёс беларускага абеззямеленага сялянства пасля рэформы 1861 г., пошукі ім шляхоў да лепшай будучыні.
                    
                    Творчасць Купалы мела свае праявы і ў перакладчыцкай дзейнасці. Да 1913 г. ён пераклаў на беларускую мову з рускай асобныя творы І. Крылова, А. Кальцова, М. Някрасава, з украінскай - Т. Шаўчэнкі, з польскай - А. Міцкевіча, М. Канапніцкай, У. Сыракомлі, тэксты ў п'есах "Сялянка" і "Залёты" В. Дуніна-Марцінкевіча.
                    
                    Беларуская літаратура праз творчасць Я. Купалы пецярбургскага перыяду пачала выходзіць на еўрапейскі культурны абсяг. Актуальныя праблемы быцця атрымалі ў ёй глыбокае філасофскае асэнсаванне, асвятляліся на высокім мастацкім узроўні, з улікам нацыянальных культурных асаблівасцей.
                    
                    З кастрычніка 1913 да жніўня 1915 г. Я. Купала зноў у Вільні, працуе ў "Беларускім выдавецкім таварыстве", у газеце "Наша ніва". Як рэдактар гэтага выдання падвяргаўся судоваму пераследаванню царскіх уладаў. 3 удзелам Купалы арганізоўваліся літаратурныя вечары, сустрэчы з рускімі, літоўскімі і польскімі пісьменнікамі. Сяброўскія адносіны падтрымліваў Я. Купала з дзеячамі літоўскай культуры: паэтам Л. Гірай, кампазітарам С. Шымкусам, мастаком і кампазітарам М. Чурлёнісам. У 1914 г. адбылася сустрэча з рускім паэтам В. Брусавым, вучнем якого Купала сябе называў і які пазней пераклаў некаторыя яго вершы на рускую мову.
                    
                    У творах гэтага часу ўсё больш выразнымі становяцца матывы нацыянальнага адраджэння, абароны роднай мовы. Публіцыстычныя выступленні Купалы заклікалі да паляпшэння сацыяльнага становішча шырокіх народных мас Беларусі, закраналі праблемы нацыянальнай самасвядомасці. У 1913 г. у артыкуле "Чаму плача песня наша?" ён выказаў сваё бачанне прынцыпаў тагачаснай беларускай літаратуры - адзначыў неабходнасць установак на народнасць і дэмакратызм, а таксама арыентацыю на высокі мастацкі ўзровень еўрапейскай літаратуры. У артыкуле "А ўсё ж такі мы жывём!.." Купала палемізаваў з польскімі нацыяналістамі, якія лічылі Беларусь часткай Польшчы, і мясцовымі шавіністамі-чарнасоценцамі, якія заяўлялі, што Беларусь гэта "истинно-русский край ", гаварыў пра дасягненні беларускага нацыянальна-вызваленчага і культурнага руху. У артыкуле "Ці маем мы права выракацца роднай мовы?" Я. Купала назваў родную мову народа найвышэйшай каштоўнасцю. У гэты ж перыяд з'яўляюцца шэдэўры любоўнай лірыкі Купалы, цыкл антываенных вершаў "Песні вайны" - як водгук на пачатак баявых дзеянняў Першай сусветнай вайны.
                    
                    Летам 1915 г. у сувязі з набліжэннем нямецкіх войск перастала выходзіць "Наша ніва", і Купала выехаў з Вільні.
                    
                    З верасня 1915 г. знаходзіўся ў Маскве, займаўся ў народным універсітэце А.Л. Шаняўскага на гісторыка-філасофскім факультэце. У студзені 1916 г. узяў шлюб з Уладзіславай Францаўнай Станкевіч. У хуткім часе быў прызваны ў армію. Служыў у Мінску, Полацку, Смаленску старшым рабочым у дарожна-будаўнічым атрадзе Варшаўскай акругі шляхоў зносін. Увесь 1918 г. Купала пражыў у Смаленску. З ліпеня працаваў агентам аддзела забеспячэння харчовага камітэта Заходняй вобласці, ездзіў па Смаленскай, Арлоўскай і Курскай губернях. Восенню 1918 г. падаў заяву з просьбай залічыць яго слухачом факультэта гісторыі мастацтваў Смаленскага аддзялення Маскоўскага археалагічнага інстытута. Абставіны жыцця, ваенныя падзеі не спрыялі творчасці. З сярэдзіны 1915 г. на працягу больш як трох гадоў Купала як паэт нічога не пісаў.
                    
                    Рэвалюцыйныя падзеі 1917 г., грамадзянская вайна 1918-1920 гг. нарадзілі матывы асуджэння насілля, класавай нянавісці, антыгуманізму. У канцы кастрычніка 1918 г. пасля доўгага творчага маўчання Купала напісаў вершы "Для Бацькаўшчыны", "У дарозе", "Песня", "Свайму народу", "На сход!", у якіх выявілася яго расчараванне ў рэвалюцыі, трывога за родны народ, прагучаў заклік да беларусаў згуртавацца і самім вырашыць лёс Беларусі.
                    
                    З студзеня 1919 г. Я. Купала пастаянна жыў у Мінску. Працаваў бібліятэкарам ва ўстанове Народнага камісарыята асветы. У Мінску знаходзіўся і падчас польскай акупацыі (жнівень 1919 - ліпень 1920 г.), у пачатку 1920 г. перанёс цяжкую хваробу. З прыходам Чырвонай Арміі працаваў рэдактарам розных беларускіх выданняў, намеснікам загадчыка літаратурна-выдавецкага аддзела Народнага камісарыята асветы, у рэдакцыі часопіса "Вольны сцяг".
                    
                    У 1919-1920 гг. шмат выступаў як публіцыст. У артыкулах гэтага перыяду ("Справа незалежнасці Беларусі за мінулы год" і інш.) выкладаў свае погляды наконт шляхоў беларускага народа да нацыянальнага самавызначэння, прапаведаваў ідэал нацыянальнай рэвалюцыі, якая дазволіла б кожнаму народу стаць гаспадаром свайго лёсу, і супрацьпастаўляў яе рэвалюцыі сацыяльнай. Погляды Купалы вызначаліся дэмакратызмам, адмаўленнем насілля, сцвярджэннем прыярытэту агульначалавечых духоўных каштоўнасцей. У той час Купала напісаў шэраг вершаў, пераклаў на беларускую мову "Слова аб палку Ігаравым", пралетарскі гімн "Інтэрнацыянал".
                    
                    З 1921 да 1930 г. Я. Купала актыўна ўдзельнічаў у літаратурна-грамадскім і культурна-мастацкім жыцці, у тым ліку ў стварэнні Беларускага дзяржаўнага універсітэта, нацыянальнага тэатра, рэспубліканскіх выдавецтваў, уваходзіў у склад камісіі па стварэнні Інстытута беларускай культуры. Абраны правадзейным членам Інбелкульта, рэарганізаванага ў кастрычніку 1928 г. у Акадэмію навук Беларусі, узначальваў літаратурна-мастацкую секцыю Навукова-тэрміналагічнай камісіі Народнага камісарыята асветы. У 1924-1925 гг. працаваў тэхнічным рэдактарам у Беларускім дзяржаўным выдавецтве. 10 чэрвеня 1925 г. Савет Народных Камісараў Беларускай Савецкай Сацыялістычнай Рэспублікі (БССР) прысвоіў Янку Купалу - першаму з беларускіх пісьменнікаў - ганаровае званне народнага паэта Беларусі і таксама пастанавіў прызначыць паэту пажыццёвую пенсію і вызваліць ад пасад, якія той займаў, каб стварыць спрыяльныя ўмовы для творчай працы. З 1928 г. Я. Купала - правадзейны член Акадэміі навук Беларусі, з 1929 г. - Акадэміі навук Украіны.
                    
                    У 1922 г. быў выдадзены зборнік "Спадчына", у які ўвайшлі вершы, напісаныя ў кастрычніку - снежні 1918 г. Назву гэтаму выданню даў аднайменны праграмны філасофска-патрыятычны верш. Усе творы тут знітаваны думкай пра лёс беларускай нацыі і чалавека на ключавым павароце гісторыі, паказаны ўвесь драматызм і трагізм рэвалюцыйных падзей, што прынеслі новыя выпрабаванні Бацькаўшчыне. У 1925 г. выйшаў зборнік "Безназоўнае", складзены пераважна з вершаў 1919-1924 гг. Тэма змешчанай у ім аднайменнай паэмы "Безназоўнае" - нацыянальнае дзяржаўнае будаўніцтва Беларусі, духоўнае самасцвярджэнне беларускага народа. У 1930 г. выдадзены зборнік вершаў Я. Купалы "Адцвітанне", у які галоўным чынам увайшлі творы, напісаныя да 1915 г. і ў 1918-1919 гг.
                    
                    У трагікамедыі "Тутэйшыя", напісанай у 1922 г., прагучала ідэя нацыянальнай незалежнасці Беларусі як ад Захаду, так і ад Усходу, у вострай сатырычнай форме выкрываліся прыстасаванства і нацыянальны нігілізм.
                    
                    З 2-й паловы 1920-х гг. Я. Купалу адкрыта пачалі абвінавачваць у так званай нацдэмаўшчыне. У маі 1930 г. у партыйным органе - газеце "Звязда" з'явіўся артыкул, дзе ён абвяшчаўся "ідэолагам буржуазнага нацыянал-адраджанізму". Родных паэта раскулачылі, ледзь не выслалі на Поўнач. Летам таго ж года Купалу выклікалі ў Дзяржаўнае палітычнае ўпраўленне (ДПУ), каб дапытаць у сфабрыкаванай справе "Саюза вызвалення Беларусі", прыпісаць яму кіраўніцтва гэтай міфічнай арганізацыяй. У лістападзе ізноў давялося даваць паказанні ў ДПУ. Паводзіў ён сябе падчас допытаў мужна і высакародна - гэта адзначалі нават следчыя, адхіляў усе абвінавачанні на адрас сябе і іншых. Праследаванне рэпрэсіўнымі органамі, цяжкі псіхалагічны стан прывялі да таго, што 20 лістапада 1930 г. Я. Купала спрабаваў скончыць жыццё самагубствам. У снежні 1930 г. у газеце "Звязда" быў апублікаваны так званы "пакаянны" ліст Я. Купалы, напісаны, на думку многіх даследчыкаў, пад дыктоўку, у якім паэт вымушаны быў прызнавацца ў "памылках" і "шкодных поглядах", абяцаў "аддаць усе свае сілы сацыялістычнаму будаўніцтву".
                    
                    У наступны перыяд Купала выбіраўся членам Цэнтральнага Выканаўчага Камітэта БССР, дэпутатам Вярхоўнага Савета БССР і Мінскага гарсавета, быў членам рэдакцыйнай камісіі па падрыхтоўцы тэксту Канстытуцыі БССР, удзельнічаў у розных камітэтах і камісіях па ўшанаванні памяці і правядзенні юбілеяў класікаў рускай і нацыянальных літаратур, з'яўляўся дэлегатам літаратурных форумаў і з'ездаў, выступаў на шматлікіх літаратурных нарадах. У маі 1934 г. прыняты ў члены Саюза савецкіх пісьменнікаў. Стваралася ўражанне, нібыта Купала сапраўды прымае паўнавартасны ўдзел у грамадскім жыцці. Аднак з боку ўлады гэта было толькі прыкрыццём палітыкі духоўнага тэрору, якую праводзіў у адносінах да яго сталінскі рэжым.
                    
                    У той час літаратурная актыўнасць Купалы рэзка зменшылася. Ажывілася яна толькі ў сярэдзіне 1930-х гг. (ляўкоўскі цыкл). Мастацкая ж вартасць паэм "Над ракою Арэсай" (1933 г.) і "Барысаў" (1934 г.), напісаных у рэчышчы "сацыялістычнага рэалізму", не адпавядала творчым магчымасцям паэта. У 1936 г. выдадзены зборнік вершаў і паэм "Песня будаўніцтву", дзе Купала паказвае працэс будаўніцтва новых форм жыцця. У 1937 г. выйшаў зборнік "Беларусі ардэнаноснай" - своеасаблівая анталогія творчасці паэта савецкага часу. Акрамя таго, у 1930-ыя гг. Купала пераклаў на беларускую мову паэму "Медны коннік" А. Пушкіна, паэмы і вершы Т. Шаўчэнкі.
                    
                    У 1937 г. Я. Купала зноў аказаўся ў спісе чарговых ахвяраў рэпрэсій, аднак, хоць мясцовыя рэпрэсіўныя органы і звярталіся да вышэйшага кіраўніцтва па дазвол на яго арышт, такой санкцыі на атрымалі. Пры гэтым у студзені 1939 г. Я. Купала быў узнагароджаны ордэнам Леніна. У кастрычніку таго ж года разам з групай беларускіх пісьменнікаў удзельнічаў у рабоце Народнага сходу Заходняй Беларусі, які прыняў Дэкларацыю аб уключэнні Заходняй Беларусі ў склад БССР. У 1941 г. за зборнік "Ад сэрца", куды ўвайшлі паэма "Тарасова доля" - паэтызацыя жыццёвага лёсу ўкраінскага паэта Тараса Шаўчэнкі і вершы, напісаныя ў 1937-1939 гг., якія ўслаўлялі савецкую рэчаіснасць, Я. Купалу была прысуджана Дзяржаўная (Сталінская) прэмія СССР 1-й ступені.
                    
                    У час Вялікай Айчыннай вайны паэт жыў у Маскве, потым у пасёлку Пячышчы каля Казані. У вершах і публіцыстычных выступленнях заклікаў да барацьбы з нямецкімі акупантамі, выказваў упэўненасць у перамозе над ворагам. Артыкулы з яго подпісам змяшчаліся ў газетах "Правда", "Известия", "Красная звезда" і інш. Купала быў членам прэзідыума Усеславянскага антыфашысцкага камітэта, удзельнічаў у грамадскіх мерапрыемствах, прысвечаных барацьбе з захопнікамі. У чэрвені 1942 г. Я. Купала прыехаў у Маскву для ўдзелу ва ўрачыстасцях з нагоды яго 60-годдзя. 28 чэрвеня ён трагічна загінуў (упаў у лесвічны пралёт з 10-га паверха) у гасцініцы "Масква" пры невысветленых абставінах.
                    
                    У 1962 г. урна з прахам паэта перавезена ў Мінск і пахавана на Вайсковых могілках.
                    
                    * * *
                    
                    Янка Купала пражыў няпростае жыццё, поўнае цяжкасцей і выпрабаванняў. Аднак яго высокія якасці як чалавека, грамадзяніна і творцы: сумленнасць, высакароднасць, гуманізм, любоў да свайго народа і Айчыны, вернасць вызначальнай ідэі ўсёй яго творчасці - нацыянальнаму, сацыяльнаму і духоўнаму разняволенню людзей, раскрытай на высокім мастацкім узроўні, заставаліся нязменнымі і неаспрэчнымі з цягам часу. Беларускі пясняр стаіць ў шэрагу тых вялікіх мастакоў свету, якім дадзена глыбока спазнаць сутнасць свайго часу, народа, яго гісторыі і выказаць гэта ў яскравай, толькі ім уласцівай форме.
                    
                    Нельга не пагадзіцца з наступнай ацэнкай беларускіх літаратуразнаўцаў: "Творчасць Янкі Купалы - летапіс жыцця беларускага народа, адбітак нацыянальнага характару, нацыянальнага светаразумення і паэтычнага светаўспрымання на пераломных гістарычных рубяжах 1-й паловы XX ст. Яна вызначаецца глыбокай народнасцю, мастацкай арыгінальнасцю, нацыянальнай адметнасцю".
                    
                    Вельмі дакладным з'яўляецца і выказванне аб Янке Купалу рускага паэта А.Т. Твардоўскага: "Лірык па складу свайго цудоўнага таленту, пясняр Беларусі, які выявіў сэрца яе з незвычайнай сілай, ён усёй сваёй паэтычнай існасцю як бы сімвалізаваў творчую моц народа".
                    
                    Можна сцвярджаць, што гучныя азначэнні, якія часта ўжываюць у адносінах да Купалы: вялікі пясняр беларускага народа, прарок нацыянальнага адраджэння і нават стваральнік нацыі з'яўляюцца цалкам дарэчнымі.
                    
                    Янка Купала належыць да тых выдатных асоб, чые творы маюць вечную каштоўнасць, з'яўляюцца класічнымі для нацыянальнай і сусветнай культуры.
                    
                    * * *
                    
                    Дзейнасць Янкі Купалы, яго роля і значэнне ў нацыянальным духоўным адраджэнні беларусаў высока ацэнена нашчадкамі.
                    
                    Створанае ім вывучае купалазнаўства - галіна беларускага літаратуразнаўства.
                    
                    Творы песняра неаднаразова перавыдаваліся асобнымі выданнямі. Зборы твораў выходзілі ў 1925-1932 гг. (у 6 тамах, першы збор твораў у гісторыі беларускай літаратуры), 1928-1940 гг. (у 4 тамах), 1952-1954 гг. (у 6 тамах), 1961-1963 гг. (у 6 тамах), 1972-1976 гг. (у 7 тамах), 1995-2003 гг. (у 9 тамах).
                    
                    Многія вершы і паэмы ўключаны ў школьныя праграмы.
                    
                    У 1959-1965 гг. прысуджалася Літаратурная прэмія імя Купалы, з 1965 г. - Дзяржаўная прэмія Беларусі імя Купалы.
                    
                    Працуюць Дзяржаўны літаратурны музей Янкі Купалы ў Мінску і чатыры яго філіялы: "Акопы" ў Лагойскім раёне, "Яхімоўшчына" ў Маладзечанскім раёне, Купалаўскія мемарыяльныя запаведнікі "Вязынка" ў Маладзечанскім раёне (дзе штогод праводзяцца купалаўскія святы паэзіі) і "Ляўкі" ў Аршанскім раёне.
                    
                    Імем паэта названы Інстытут літаратуры Нацыянальнай акадэміі навук Беларусі, Нацыянальны акадэмічны тэатр у Мінску, Гродзенскі універсітэт, пасёлак у Глускім, вёска ў Пухавіцкім раёнах, калгасы, бібліятэкі, школы, вуліцы ў многіх гарадах і населеных пунктах Беларусі.
                    
                    Асоба Янкі Купалы знайшла значнае ўвасабленне ў мастацтве. Яму прысвечаны скульптурныя і жывапісныя работы, музычныя і кінематаграфічныя творы, вершы. Помнікі Янку Купалу пастаўлены ў Вязынцы, Акопах, Радашковічах, Ляўках, Мінску. На дамах, дзе ў розны час жыў Купала, - у Ляўках Аршанскага раёна, Вязынцы і Яхімоўшчыне Маладзечанскага раёна, вёсках Сенніца Мінскага раёна, Бяларучы Лагойскага раёна, Старая Беліца Сенненскага раёна, Косіна Лагойскага раёна, у гарадах Мар' інай Горцы, Барысаве, Маладзечне, Капылі - устаноўлены мемарыяльныя дошкі. Шэраг твораў жывапісцаў, прысвечаных асобе і дзейнасці народнага паэта, сабраны ў альбоме "Янка Купала ў творчасці беларускіх мастакоў". Да юбілейных дат былі прымеркаваны мастацкія выстаўкі. У гонар 110-гадовага юбілею Я. Купалы выпускалася памятная манета. Кампазітарам В. Помазавым напісаны вакальна-сімфанічны твор "Янка Купала". Жыццю і творчасці паэта прысвечаны хранікальна-дакументальны фільм "А зязюля кукавала", тэлефільмы "Паклон мой народу за песні", "Ніколі я не паміраў", "Імша па Купалу".
                    
                    Творы Янкі Купалы сталі крыніцай натхнення многіх кампазітараў. М. Чуркіным створана опера "Раскіданае гняздо". Па матывах паэмы "Магіла льва" напісаў оперу "Машэка" Р. Пукст, а Я. Глебаў - сімфанічную "Паэму-легенду". Ён жа на сюжэты "Кургана" і "Магілы льва" стварыў балеты "Выбранніца" і "Курган". І. Лучанок напісаў паэму-легенду "Гусляр" паводле Купалавага "Кургана", Г. Гарэлава - сімфанічную паэму "Бандароўна", Ю. Семяняка - музычную камедыю "Паўлінка". А. Мдзівані стварыў цыкл хораў, Л. Шлег - харавую паэму "Вяснянка" паводле паэмы "Яна і я". Оперу-прытчу "Песня пра долю" У. Мулявіна на словы Купалы выконваў ансамбль "Песняры". Вершы паэта паклалі на музыку М. Аладаў, М. Анцаў, А. Багатыроў, К. Галкоўскі, А. Грыневіч, М. Мацісон, С. Палонскі, А. Пашчанка, Р. Пукст, Л. Рагоўскі, А. Сакалоўскі, А. Туранкоў, У. Тэраўскі, Я. Цікоцкі, М. Чуркін, Л. Ямпольскі і інш.
                    
                    Драматургічныя творы Янкі Купалы ставіліся ў шматлікіх тэатрах. Яго п'есы "Паўлінка", "Раскіданае гняздо", паэма "Магіла льва" экранізаваны.
                    
                    Творчасць Янкі Купалы заслужыла сусветнае прызнанне - пра гэта сведчыць шырокі грамадскі рэзананс, які яна атрымала ў многіх краінах свету. Творы беларускага песняра перакладзены амаль на 100 замежных моў. Толькі верш "А хто там ідзе?" перакладзены на 82 мовы народаў свету, у тым ліку на найбольш распаўсюджаныя - англійскую, арабскую, італьянскую, кітайскую, нямецкую, рускую, французскую, хіндзі, японскую і іншыя.
                    
                    Пра міжароднае ўшанаванне памяці паэта сведчаць купалаўскія мемарыяльныя знакі за межамі Беларусі. Помнік Купалу ўсталяваны ў Араў-парку ў Нью-Йорку, плануецца адкрыццё помніка ў Маскве. У Санкт-Пецярбургу, Смаленску, Кіславодску, пасёлку Пячышчы каля Казані, вёсцы Соф' іна Раменскага раёна Маскоўскай вобласці (Расія), Вільнюсе (Літва), пасёлку Гаспра каля Ялты (Украіна) устаноўлены мемарыяльныя дошкі, прысвечаныя паэту. Імем Янкі Купалы былі названы судны Дунайскага і Волжскага параходстваў. Купалаўскія найменні атрымалі школа і вуліца ў Душанбе (Таджыкістан), бібліятэка ў Харкаве і вуліцы ў Кіеве і Запарожжы (Украіна), вуліцы ў Ташкенце (Узбекістан), Тбілісі (Грузія), Рызе (Латвія), Ніжнім Ноўгарадзе (Расія), Беластоку (Польшча) і інш. У Порту-Алегра (Бразілія) у 1932 г. імя Я. Купалы прысвоена бібліятэцы-чытальні.
                    
                    У 1996 г. створаны Міжнародны фонд Янкі Купалы.
                    
                    100-гадовы юбілей беларускага песняра паводле рашэння ЮНЕСКА адзначаўся ў міжнародным маштабе.
                    
                    У 2007 г. у Рэспубліцы Беларусь на дзяржаўным узроўні адзначаецца 125-годдзе з дня нараджэння народнага паэта Янкі Купалы.`
                },
                {
                    "Tag" :"Bikov",
                    "Name" : "Васіль Уладзіміравіч Быкаў",
                    "RealName" : "Васіль Уладзіміравіч Быкаў",
                    "Birth" : "19 чэрвеня 1924",
                    "Die" : " 22 чэрвеня 2003",
                    "Photo" : ["1","2", "3", "4", "5", "6", "7"],
                    "Video" : "1",
                    "Bio" : `
                    Дзяцінства і маладыя гады
Нарадзіўся ў сялянскай сям’і. З дзяцінства захапляўся маляваннем. У 1939 годзе скончыў 8 класаў Кубліцкай сярэдняй школы, паступіў на скульптурнае аддзяленне Віцебскага мастацкага вучылішча. Аднак увосень 1940 года ў сувязі з пагаршэннем матэрыяльнага становішча сям’і і адменай дзяржаўных стыпендый вымушаны быў пакінуць вучобу[9]. Паступіў у Віцебскую школу ФЗН № 5, дзе вучыўся да мая 1941. У чэрвені 1941 года экстэрнам здаў экзамены за дзясяты клас.

            Вялікая Айчынная вайна
Вайна заспела яго ва Украіне, дзе ён удзельнічаў у абаронных работах. Падчас адступлення, у Белгарадзе, адстаў ад сваёй калоны, пасля быў арыштаваны і ледзь не расстраляны як нямецкі шпіён[10].

Быў мабілізаваны на абарончыя работы. У якасці байца інжынернага батальёна будаваў розныя ваенныя аб’екты ад Гомеля да Варонежа. Зімой 1941—1942 жыў на ст. Салтыкоўка(руск.) бел. і ў г. Аткарску Саратаўскай вобласці, дзе вучыўся ў чыгуначнай школе. Улетку 1942 года быў прызваны ў Чырвоную Армію, скончыў Саратаўскае пяхотнае вучылішча (з 80 выпускнікоў у вайну ацалела толькі чацвёра). Увосень 1943 года прысвоена званне малодшага лейтэнанта. Ваяваў на 2-м і 3-м Украінскіх франтах. Удзельнічаў у баях за Крывы Рог, Александрыю, Знам’янку.

Падчас Кіраваградскай аперацыі(руск.) бел. паранены ў нагу і жывот (памылкова быў запісаны як загінулы); падзеі пасля ранення паслужылі асновай аповесці «Мёртвым не баліць». Бацькі В. Быкава атрымалі паведамленне, што іх сын мужна загінуў у баях з нямецка-фашысцкімі захопнікамі каля Кіраваграда (гэта было засведчана на абеліску).

У пачатку 1944 года тры месяцы знаходзіўся ў шпіталі.

В. Быкаў выжыў і ваяваў далей, удзельнічаў у Яска-Кішынёўскай аперацыі, вызваленні Румыніі. 3 дзеючай арміяй прайшоў Румынію, Балгарыю, Венгрыю, Югаславію, Аўстрыю — старшым лейтэнантам, камандзірам узвода палкавой, потым армейскай артылерыі. Служыў на Украіне, у Беларусі, на Далёкім Усходзе. Пра вайну ў кнізе ўспамінаў «Доўгая дарога дадому» (2003) успамінаў так:

"	Прадчуваю сакраментальнае пытанне пра страх: баяўся ці што? Вядома, баяўся, а, можа, часам і збаяўся. Але страхаў на вайне шмат, і яны ўсе розныя. Страх перад немцамі - што маглі ўзяць у палон, застрэліць; страх з-за агню, асабліва артылерыйскага або бамбёжак. Калі выбух побач, так, здаецца, цела само, без удзелу розуму, гатова разарвацца на кавалкі ад дзікіх пакут. Але быў жа і страх, які ішоў з-за спіны - ад начальства, усіх тых карных органаў, якіх у вайну было не менш, чым у мірны час. Нават больш.[10]	"
Пасляваенныя гады
Пасля дэмабілізацыі В. Быкаў жыў у Гродне (з 1947), працаваў мастаком у гродзенскіх майстэрнях, у рэдакцыі абласной газеты «Гродзенская праўда» (1947—49). У 1949—55 зноў служыў у Савецкай Арміі. Канчаткова дэмабілізаваўшыся (маёр запаса), працаваў літаратурным супрацоўнікам, літаратурным кансультантам газеты «Гродзенская праўда» (1956—72).

Васіль Быкаў у час гутаркі з Аляксеем Гардзіцкім успамінаў, што "На пачатку літаратурнага шляху мяне вельмі падтрымаў, проста сказаў, што я павінен пісаць, Георгій Шчарбатаў. Я не ведаю, што ён заўважыў, але ён так сказаў. Прынамсі, я яму абавязаны, што стаў пісьменнікам, бо мог бы ім і не стаць.[11].

Член Саюза пісьменнікаў СССР з 1959 года. Выступаў як журналіст. У абласным і рэспубліканскім друку пачалі з’яўляцца яго замалёўкі, фельетоны, нарысы. Быў абраны сакратаром Гродзенскага аддзялення СП БССР (1972—78). У 1978 годзе пераехаў на сталае жыццё ў Мінск. 3 гэтага часу займаўся выключна творчай працай.

Уваходзіў у склад праўлення СП СССР, Рады СП БССР, рэспубліканскага Савета Фонда міру. Ганаровы грамадзянін Ушацкага раёна.

У 1988 годзе стаў адным з заснавальнікаў Беларускага народнага фронту.

Выбіраўся дэпутатам Вярхоўнага Савета БССР (1978—89). Народны дэпутат СССР (1989).

Бескампраміснасць прозы Быкава часта станавілася прычынай нападаў савецкай крытыкі, якая абвінавачвала пісьменніка ў ачарненні савецкага ладу.

Быў прэзідэнтам Беларускага ПЭН-цэнтра(руск.) бел.. У 1990 абраны прэзідэнтам Згуртавання беларусаў свету «Бацькаўшчына», заставаўся на гэтай пасадзе да 1993 года[12].

У кастрычніку 1993 года падпісаў адкрыты «ліст сарака двух(руск.) бел.».

Перад першымі прэзідэнцкімі выбарамі ў Беларусі (чэрвень 1994 года) быў даверанай асобай кандыдата Зянона Пазняка, выступаў у гэтай якасці ў час паездак па Беларусі і на тэлебачанні[13].

У лістападзе 1994 года наведаў Ізраіль і падзяліўся сваімі ўражаннямі ў нарысе для зборніка «Поклон тебе, Иерусалим» (1996)[14].

Нападкі на Васіля Быкава, якія зноў пачаліся на радзіме ў сярэдзіне 1990-х гг., і стан здароўя сталі прычынай выезду за мяжу.

У пачатку 1998 года Васіль Быкаў на запрашэнне Фінскага ПЭН-цэнтра вырашыў пажыць у Фінляндыі, куды і пераехаў разам з жонкай у чэрвені таго ж года[15]. У снежні 2002 Васіль Быкаў пасяліўся ў Чэхіі, перад гэтым пэўны час жыў у Германіі. У 2002 апублікаваў кнігу ўспамінаў «Доўгая дарога дадому». У Чэхіі перанёс аперацыю, пасля пагаршэння здароўя вярнуўся на Беларусь. Памёр 22 чэрвеня 2003 года ў 20 гадзін 30 хвілін у рэанімацыйным аддзяленні анкалагічнага шпіталю ў Бараўлянах, пад Мінскам[16].

Пахаваны ў Мінску на Усходніх могілках. Падчас пахавання быў адпеты ўніяцкімі святарамі, труну пісьменніка накрылі бел-чырвона-белым сцягам[17].

        Творчасць
Творчая біяграфія пісьменніка пачынаецца ў пасляваенныя гады. Першыя апавяданні Васіля Быкава былі надрукаваны ў часопісе «Вожык» (1947, «Дапякло»), газеце «Гродзенская праўда» (1949, «У першым баі»).

Тэматыка ранніх апавяданняў, як і многіх далейшых твораў Васіля Быкава, прысвечана падзеям вайны.

Сам В. Быкаў свой пісьменніцкі лёс адлічвае з 1951, калі на Курылах, дзе ў той час служыў, напісаў апавяданні «Смерць чалавека» і «Абознік». Іх ён паслаў на водгук М. Лынькову. Нягледзячы на ўвогуле ўдалы творчы дэбют, В. Быкаў не быў перакананы ў тым, што літаратура — яго жыццёвае прызванне. 3 героя апавядання «У першым баі» Мікалая Беражнога пачаліся быкаўскія героі — маладыя афіцэры і салдаты з трагічным франтавым лёсам.

Першы зборнік «Ход канём» (1960) раскрывае пасляваеннае жыццё савецкіх людзей, іх узаемаадносіны ў працы, побыце, паказвае нараджэнне новых якасцей у характары чалавека, асабліва моладзі.

Канец 1950-х — пачатак 1960-х гадоў для В. Быкава — час пошукаў самога сябе. Ён піша сатырычныя мініяцюры, гісторыка-прыгодніцкую аповесць «Апошні баец», серыю навел на маральна-этычныя тэмы, другі цыкл ваенных апавяданняў, нарысы, рэцэнзіі. Гэтыя творы сведчаць пра тое, што іх аўтар ішоў да свайго адкрыцця свету, да аналітычнага даследавання чалавечага быцця, рашуча адмаўляючыся ад дробнатэмнасці, апісальнасці. Кожны твор быў для яго своеасаблівай школай майстэрства, пяро пісьменніка сталела, почырк набываў большую індывідуальную афарбоўку, мова — выразнасць і дакладнасць. В. Быкаў набліжаўся да раскрыцця тых трагічных падзей 1941—45, з якімі сутыкаецца галоўны герой яго аповесцей.

У «Жураўліным крыку» (1959) пісьменнік звярнуўся да ваеннай тэмы, каб застацца ёй верным амаль увесь час. Паводле зместу, шэсць ваенных, кожны з якіх — жывая чалавечая індывідуальнасць, гінуць у барацьбе з фашысцкімі захопнікамі. У наступных яго аповесцях паўстае перад чытачом гранічна праўдзівае адлюстраванне вайны. Яго творы нязменна нясуць у сабе моцны зарад маральнай энергіі, неабходнай чалавеку сёння.

Шырокая вядомасць прыйшла да Быкава пасля публікацыі аповесці «Трэцяя ракета» (1961).

Тэма чалавека на вайне таксама праходзіць праз аповесці «Пастка» (1962), «Альпійская балада» (1963), «Праклятая вышыня» (1968).

Аднак у застойныя гады афіцыйная крытыка непрыймальна ставілася да бескампрамісных аповесцей В. Быкава пра вайну. Адзін з самых вострапраўдзівых яго твораў «Мёртвым не баліць» (1965) убачыў свет на той час толькі ў часопісах «Маладосць» і «Новый мир(руск.) бел.», дзякуючы грамадзянскай мужнасці іх рэдактараў П. Панчанкі і А. Твардоўскага. В. Быкава абвінавачвалі ў тым, што ён не з тых пазіцый піша пра вайну, скажае праўду, ачарняе гераічных савецкіх воінаў. Па камандзе галоўных тады партыйных ідэолагаў (М. Суслава, М. Зімяніна і так званага «спецыяліста» па беларускай літаратуры ў Аддзеле прапаганды ЦК КПСС У. Сяўрука) былі арганізаваны калектыўныя пісьмы «незадаволеных» быкаўскім адлюстраваннем падзей вайны. Нягледзячы на тое, што многія творчыя саюзы, выдавецтва «Мастацкая літаратура» і яго дырэктар М. Дубянецкі, шматлікія чытачы патрабавалі ўключыць «Мёртвым не баліць» у збор твораў В. Быкава, М. Суслаў, а пасля М. Зімянін загадалі ніколі яе не друкаваць і ўсякія размовы пра выданне спыніць, хоць у многіх краінах гэты твор ужо тады выйшаў асобнай кнігай. I ўсё ж грамадская думка перамагла: аповесць была ўключана ў 4-ы том збору твораў пісьменніка.

У 1970-я гады В. Быкаў працягвае цыкл аповесцей на ваенную тэму: «Сотнікаў(бел. (тар.)) бел.» (1970), «Абеліск» (1971), «Дажыць да світання» (1972), «Воўчая зграя» (1974), «Яго батальён» (1975).

Ваенныя аповесці В. Быкава — гэта высокамастацкія творы, з якіх складаецца гераічны эпас пра Вялікую Айчынную вайну. У іх аўтар сцвярджае выпрабаваныя ў полымі барацьбы з фашызмам ідэйныя і маральныя якасці: вернасць адвечным агульначалавечым каштоўнасцям, інтэрнацыяналізм, любоў да роднай зямлі, высокую годнасць чалавека-працаўніка і воіна. У творчасці В. Быкава прасочваюцца ідэйна-эстэтычныя пошукі савецкай літаратуры апошняга часу, далейшае развіццё такіх яе неад’емных якасцей, як філасафічнасць, аналітычнасць, псіхалагізм, глыбокае раскрыццё ўнутранага свету чалавека, яго паводзін у экстрэмальных умовах ваенных гадоў. У партызанскім цыкле аповесцей («Круглянскі мост» (1968), «Пайсці і не вярнуцца» (1978), «Знак бяды(руск.) бел.» (1982) з асаблівай сілай выявілася праблема трагічнага, адвечная тэма выбару ў складаных умовах акупіраванай тэрыторыі і партызанскай барацьбы народа супраць фашыстаў. Не менш востра паказаў пісьменнік і падзеі калектывізацыі, да якіх упершыню звярнуўся ў аповесці «Знак бяды». У беларускай літаратуры ніхто так аголена-праўдзіва, з болем, абгрунтавана не паказаў бессэнсоўнасць, жорсткасць сталінскіх метадаў абагульнення сялянскіх гаспадарак, вытручвання ў селяніне-працаўніку любові да зямлі-карміцелькі, вынішчэння яго гаспадарчых традыцый. Гэту тэму пісьменнік працягвае даследаваць і ў аповесці «Аблава», дзе, асвятляючы падзеі калектывізацыі, упершыню ў беларускай літаратуры паказвае спецперасяленца, працавітага, гаспадарлівага селяніна Хведара Роўбу, які быў высланы з сям’ёй на Поўнач, а потым, пры спробе вярнуцца ў родную вёску, загінуў пакутніцкай смерцю.

Пераасэнсаванне мінулага стала галоўным напрамкам, па якім рухалася быкаўская думка ў 1980-я гады. Пісьменнік пераасэнсоўвае і прыкметна ўдакладняе многае з таго, што ўпэўненна сцвярджаў у сваіх творах. У рамане «Кар’ер» (1985) паяднаны сучаснасць і вайна. Складаны лёс чалавека ва ўмовах фашысцкай акупацыі пісьменнік паказвае ў аповесці «У тумане» (1988). «Аблава» (1989) мае рэальную жыццёвую аснову. В. Быкаў акцэнтуе ўвагу на злавесна-разбуральнай сутнасці часу і гаворыць пра катастрафізм духоўнага быцця ў цэлым. З суровым рэалізмам у адлюстраванні падзей напісана быкаўская «Сцюжа» (1969, 1991).

У 1990-я В. Быкаў бярэ на ўзбраенне апавяданне. «На чорных лядах», «Бедныя людзі» (абодва — 1994), «Жоўты пясочак», «Зенітчыца», «Палкаводзец», «Палітрук Каламіец», «Падоранае жыццё» (усе — 1995).

Аповесць «Пакахай мяне, салдацік» (1996) тэматычна звязана з цыклам «ваенных» апавяданняў. Аповесць «Ваўчыная яма» (1999) расказвае пра жыццё ў чарнобыльскай зоне. Надзвычай складаныя рэаліі ваеннай рэчаіснасці паўстаюць з аповесці «Балота» (2001).

Яшчэ адна іпастась пісьменніка — аўтар «баек жыцця» з філасофска-алегарычным зместам: «Сцяна(бел. (тар.)) бел.» (1995), «Музыка», «Народныя мсціўцы» (абодва — 1997), «Ваўчыная яма», «Мальбара», «Тры нявымаўленых словы», «Труба» (усе — 1998), «Галоўны крыгсман», «Хутаранцы», «Апалагетыка „нагана“», «Кошка і мышка» (усе — 1999). Выходзяць кнігі прозы «Сцяна» (1997), «Пахаджане» (1999). Быкаўскія прыпавесці ўвайшлі ў супольную кнігу Р. Барадуліна і В. Быкава «Калі рукаюцца душы» (2003). Працягвае тэму сяброўства кніга «Дажыць да зялёнай травы» (2008). Кнігу пад такой назвай В. Быкаў і Р. Барадулін пісалі 43 гады. Складаецца яна з сяброўскага ліставання двух выдатных творцаў, якое пачалося ў 1960.

У гады перабудовы В. Быкаў актывізаваўся як грамадскі дзеяч, публіцыст. Яго выступленні, артыкулы, інтэрв’ю склалі зборнікі «На крыжах» (1992) і «Крыжовы шлях» (1998). Пісьменнік падсумаваў вынікі свайго жыцця і творчасці кнігай успамінаў «Доўгая дарога дадому» (2002).

Адной з апошніх прац В. Быкава сталі аповеды Барыса Кіта, запісаныя Васілём Быкавым улетку 2001 «Цярновы шлях», якія пазней увайшлі ў кнігу «Грамадзянін свету» (2004). Кожны з 12 аповедаў пачынаецца лірычна-белетрыстычным уступам самога В. Быкава, які пры гэтым каларытна характарызуе нямецкія рэаліі і апавядальніка.

Але і пасля смерці Васіля Быкава з’яўляюцца на старонках друку невядомыя беларускаму чытачу творы. У кнігу «Бліндаж» (2007) увайшлі аповесці «Бліндаж» (1987) і «Апошні баец» (1958), якія раней не ўключаліся аўтарам у ніводзін свой зборнік.

Экранізацыі і інсцэнізацыі твораў
Па творах В. Быкава пастаўлены кінафільмы «Трэцяя ракета(руск.) бел.» (1963), «Альпійская балада» (1966), «Дажыць да світання» (1975), «Воўчая зграя» (1976), «Абеліск» (1977), «Узыходжанне(руск.) бел.» (1977, паводле «Сотнікава», рэжысёр Ларыса Шапіцька(руск.) бел.) «Знак бяды» (1985), «У тумане» (2012), кароткаметражны фільм «Пастка(руск.) бел.», тэлефільм «Доўгія вёрсты вайны(руск.) бел.» (1976, паводле аповесці «На ўсходзе сонца»). В. Дашуком створаны фільм пра В. Быкава «Узыходжанне» (1985). У 1981 годзе быў зняты фільм «Фруза(руск.) бел.», а ў 1989 годзе — фільм «Круглянскі мост(руск.) бел.». У 2008 годзе выйшаў фільм «Асуджаныя на вайну(руск.) бел.» паводле аповесці «Пайсці і не вярнуцца». У 2019 годзе зняты фільм па «неваеннаму» апавяданню — «Народныя мсціўцы». Дарэчы, на беларускай мове з ўсіх экранізацый твораў Быкава зняты толькі два фільмы — «На чорных лядах» (рэж. Валерый Панамароў, 1995 г.) і «Народныя мсціўцы» (рэж. Аляксандар Меліхавец, 2019 г.).

П’еса «Апошні шанц» ставілася ў тэатрах. Былі інсцэніраваны яго аповесці «Абеліск», «Альпійская балада», «Дажыць да світання» (усе — Масква), «Знак бяды» (Гомель, Ленінград, Мінск), «Пайсці і не вярнуцца» (Кастрама, Масква, Чарнігаў), «Сотнікаў» (Ленінград, Магілёў), «Трэцяя ракета» (Кіеў, Масква) і інш. У 1990 пастаноўка радыёспектакляў па аповесцях В. Быкава «У тумане» і «Кар’ер» адзначаны Дзяржаўнай прэміяй БССР.

Балет «Альпійская балада» (1967) напісаў Яўген Глебаў, на яго ж аснове стварыў «Сюіту з балета „Альпійская балада“». Оперу «Сцежкаю жыцця» (1980, паводле «Воўчай зграі») стварыў Генрых Вагнер. Да творчасці пісьменніка звярталіся мастакі А. Кашкурэвіч, I. Немагай.

Узнагароды
Герой Сацыялістычнай Працы (1984). Лаўрэат Літаратурнай прэміі імя Я. Коласа (1964, за аповесць «Трэцяя ракета»), Дзяржаўнай прэміі СССР (1974, за аповесці «Абеліск», «Дажыць да світання»), Дзяржаўнай прэміі БССР імя Я. Коласа (1978), за аповесці «Воўчая зграя», «Яго батальён»), Ленінскай прэміі (1986, за аповесць «Знак бяды»). У 1980 атрымаў званне Народнага пісьменніка Беларусі, Узнагароджаны ордэнамі Леніна, Працоўнага Чырвонага Сцяга, Чырвонай Зоркі, Айчыннай вайны 1-й ступені, медалямі.

Лаўрэат прэміі «Залаты апостраф» (2003, пасмяротна).

Ушанаванне памяці
У гонар пісьменніка названы вуліцы ў Гродне, Лельчыцах, Ждановічах, Смалявічах, Фаніпалі.

У г. Віцебску ўсталявана мемарыяльная дошка па вуліцы Суворава, 15, на будынку дзіцячай мастацкай школы № 1 (у гэтым будынку з 1923 па 1941 знаходзілася Віцебскае мастацкае вучылішча, дзе з 1939 па 1940 вучыўся Васіль Быкаў)[9]. Мемарыяльная дошка вырабленая з бронзы і ўяўляе сабой стылізаваную рамку ў выглядзе аркі, усярэдзіне якой змешчаны партрэт пісьменніка і бусел, як сімвал Беларусі. На дошцы надпіс на беларускай мове: «У гэтым будынку з 1939 па 1940 год вучыўся народны пісьменнік Беларусі Васіль Быкаў». Аўтарамі кампазіцыі з’яўляюцца віцебскія скульптары, члены Беларускага саюза мастакоў Валерый Магучы і Аляксандр Гвоздзікаў[18].

Музей Васіля Быкава
У 2012 была пачата работа па стварэнні музея Васіля Быкава. Музей адкрыты на базе дачы пісьменніка, размешчанай у пасёлку Ждановічы-6 Мінскага раёна. У гэтых мэтах 27 ліпеня 2012 года была прынята пастанова ўрада Беларусі, у адпаведнасці з якой дача бязвыплатна перададзена Ірынай Міхайлаўнай Быкавай ва ўласнасць дзяржавы. Музей створаны як філіял Дзяржаўнага музея гісторыі беларускай літаратуры. Ажыццёўлены капітальны рамонт дачы з яе прыстасаваннем пад музейную ўстанову, добраўпарадкавана прылеглая тэрыторыя, створаны камфортныя ўмовы для наведвальнікаў. Супрацоўнікі Дзяржаўнага музея гісторыі беларускай літаратуры правялі навуковую апрацоўку архіва і асабістых рэчаў Васіля Быкава, якія склалі аснову экспазіцыі. У ёй прадстаўлены асноўныя этапы жыцця і творчасці пісьменніка, яго ўзаемаадносіны з сябрамі, блізкімі і калегамі, адлюстраваны асаблівы ўклад ва ўвасабленне тэмы Вялікай Айчыннай вайны ў беларускай і сусветнай літаратуры, міжнароднае прызнанне яго твораў. Музей Васіля Быкава адкрылі ў чэрвені 2014 да яго 90-годдзя.
                    `
                },
                {
                    "Tag" :"Melez",
                    "Name" : "Івaн Пaўлавіч Мeлеж",
                    "RealName" : "Івaн Пaўлавіч Мeлеж",
                    "Birth" : "8 лютага 1921",
                    "Die" : "9 жніўня 1976",
                    "Photo" : ["1","2", "3", "4", "5", "6", "7", "8", "9", "10", "11"],
                    "Video" : "1",
                    "Bio" : `
                    Біяграфія
Іван Паўлавіч Мележ нарадзіўся 8 лютага 1921 года ў звычайнай сялянскай сям'і ў вёсцы Глінішча. Хойніцкага раёна Гомельскай вобласці. У Івана было звычайнае вясковае дзяцінства і юнацтва. З маленства І. Мележ убіраў у сябе не толькі хараство родных краявідаў. Ён засвойваў і маральныя законы, па якіх жылі землякі. Прыкладам жыццёвай мудрасці, дабраты і справядлівасці найперш была маці, простая сялянка. Марыя Дзянісаўна была родам з Каранёўкі, многа ведала народных песень і любіла спяваць. Зямлі было мала. Бацька рабіў гонты, дзяжы, цабэркі. Дзеці таксама змалку ўцягваліся ў работу. Будучы пісьменнік з пяці гадоў пасвіў свіней. Яго, калі можна сказаць так, пастухоўскі ранг павышаўся: пасля свіней пасвіў авечак, цялят, карову, пазней вадзіў у начное каня.

Вучыўся ён аж у трох школах: у пачатковай — у родным Глінішчы, у сямігодцы — у Алексічах, заканчваў дзесяцігодку ў Хойніках.

Удзельнічаў ў школьных спектаклях, пісаў вершы і вучыўся старанна: заканчае дзесяцігодку з залатым медалём. Пасля сканчэння сярэдняй школы пасылае дакументы ў Маскоўскі ІФЛІ (Інстытут гісторыі, філасофіі, літаратуры), і хоць выдатнікаў мусілі прымаць без экзаменаў, Мележ нават выклік з інстытута не атрымаў.

Bяpнyўcя ў Хoйнiкi, пpaцaвaў y paйкaмe кaмcaмoлa. У гэты час шмат ездзіць па вёсках, мае зносіны з людзьмі, назірае за іх жыццём. У 1939 гoдзe I. Мeлeж cтaнoвiццa cтyдэнтaм тaгo ж мacкoўcкaгa iнcтытyтa, aлe з пepшaгa кypca пpызвaны ў apмiю. У войску, нягледзячы на забарону, вядзе ваенныя дзённікі, якія ў большасці былі згубленыя пасля пачатку вайны.

У шэрагах савецкай арміі
З першых дзён Вялікай Айчыннай вайны ён на фронце. У 1940 годзе ўдзельнічае у паходах на Бесарбію і Букавіну. У пачатку Вялікай Айчыннай вайны ваяваў над Нікалаевам і Растовам-на-Доне. У ліпені 1941 года быў сур'ёзна паранены ў правае плячо над Растовам і адпраўлены ў шпіталь у Тбілісі. У 1942 годзе скончыў курсы палітработнікаў і быў камандзіраваны ў 51-ю стралковую дывізію супрацоўнікам газеты.

Пад Растовам атрымлівае другое раненне. Асколкам бомбы яму раздрабіла правае плячо, і ўсю руку хацелі ампутаваць. Але знайшоўся хірург, які выратаваў яе. Пасля гэтага пісьменнік атрымаў інваліднасць, і камісія прызнае яго "нягодным да страявой службы".

Жыццё пасля ранення
Ён напачатку не ведаў, куды ехаць і як жыць далей. Цягніком ён дабіраецца да Баку, адтуль на параходзе да Гур'ева і Бугуруслан. Там працаваў эвакуіраваны з Малдавіі педінстытут, выходзіла мясцовая газета «Бугурусланская правда». У хуткім часе мы бачым Мележа студэнтам-завочнікам і адначасова выкладчыкам ваеннай падрыхтоўкі гэтага інстытута. Час быў ваенны, цяжкі, і трэба было неяк жыць. Тым болей, што пісьменнік стаў чалавекам сямейным. Знясілены, але магутны арганізм, душа і характар маладога чалавека прагнуць ведаў, і шчасце, нарэшце, усміхаецца яму: у 1943-м Івана пераводзяць у Беларускі дзяржаўны ўніверсітэт, які грунтаваўся тады на падмаскоўнай станцыі Сходня. Працу тым жа выкладчыкам ваеннай падрыхтоўкі ён спалучае з вучобай на завочным аддзяленні філалагічнага факультэта БДУ, пасля перакладаецца на стацыянар і ўжо ў вызваленым Мінску атрымлівае дыплом аб вышэйшай адукацыі. Прага ведаў, аднак, не змяншаецца: Мележ Іван Паўлавіч паступае ў аспірантуру, працаваў над дысертацыяй па творчасці Кузьмы Чорнага, выкладаў родную беларускую літаратуру там жа, у родным універсітэце. Тады і зрабіў ён першую сур'ёзную заяўку ў мастацкай прозе-сваімі апавяданнямі і аповесцямі, эсэ і нарысамі.

Працаваў у рэдакцыі часопіса «Полымя», у апараце ЦК КПБ. Член Саюза пісьменнікаў СССР з 1945, у 1966 годзе робіцца сакратаром Саюза пісьменнікаў БССР, а ў 1971-1974 гадах працуе намеснікам старшыні праўлення гэтай арганізацыі.

Выбіраўся дэпутатам ВС БССР (1967—1976). Іван Мележ быў старшынём праўлення Беларускага аддзялення таварыства «СССР — Францыя», старшынёй Беларускага камітэта абароны Міру, членам Сусветнага Савета Міру.

Памёр 9 жніўня 1976 г., пахаваны на Усходніх могілках у Мінску.

Творчасць
Сxoднeнcкi пepыяд быў нaдзвычaй вaжным y cтaнaўлeннi Мeлeжa-мacтaкa, бo мeнaвiтa тyт ён цвёpдa выpaшыў cтaць пicьмeннiкaм. Пepшыя cвae aпaвядaннi дaвepыў Кyзьмe Чopнaмy i aтpымaў пaдтpымкy: cтaлы мaйcтap нacтoйлiвa paiў пicaць, пpaцaвaць нaд caбoй i caчыць "зa пcixaлaгiчным aбгpyнтaвaннeм чaлaвeчыx yчынкaў".

Аcнoўныя этaпы твopчacцi пicьмeннiкa:

1. Рaннi пepыяд твopчacцi (cтaнaўлeннe);

2. Baeнны пepыяд твopчacцi;

3. Пacлявaeнны пepыяд;

4. Tвopчacць 1950-x гaдoў;

5. Tвopчacць 1960-1980-x гaдoў (твopчaя cтaлacць).

Пісаць вершы і апавяданні І. Мележ пачаў яшчэ вучнем. Літаратурныя захапленні юнака падтрымаў настаўнік М. Пакроўскі, які спрыяў апублікаванню ў 1939 годзе ў «Чырвонай змене» першага верша — «Радзіме». Першае выступленне ў друку як празаіка адносіцца да 1943 г.: газета «Бугурусланская правда» апублікавала апавяданне на рускай мове «Последняя операция». 25 лістапада 1944 г. газета «Звязда» надрукавала апавяданне на беларускай мове «Сустрэча ў шпіталі».

У 1941—1942 гадах І. Мележ вёў дзённік, запісы якога ў 1977 годзе ўвайшлі ў яго «Першую кнігу», што ўбачыла свет ужо пасля смерці пісьменніка. У 1946 гoдзe выйшaў збopнiк "У зaвipyxy", дзe мaлaды пicьмeннiк зpaбiў paшyчы кpoк дa aвaлoдвaння мaйcтэpcтвaм пcixaлaгiчнaгa aнaлiзy — высока ацаніў Кузьма Чорны.

У 1948 годзе была выдадзена кніга прозы «Гарачы жнівень». Назву ёй дала аднайменная аповесць, напісаная ў 1946 го дзе пасля наведвання спаленай і спустошанай падчас вайны роднай вёскі. Аўтар паэтызуе будзённую сялянскую працу, перадае душэўную прыгажосць простых вясковых людзей. Менавіта ў гэты час пісьменнік па-новаму адчуў, што значыць Палессе ў яго жыцці. Ужо ў ранніх творах І. Мележа назіралася тэндэнцыя да аб’яднання ў цыклы («Гарачы жнівень», апавяданні «Перад навальніцай» і «Павел прыехаў»).

Паступова пашыраліся жанравыя рамкі творчасці пісьменніка. З канца 1947 года ён працуе над раманам «Мінскі напрамак» (1947—1953). Аўтар расказвае пра вызваленчую барацьбу на Беларусі летам 1944 года, пра аперацыю «Баграціён». Праца над «Мінскім напрамкам» стала важным этапам у творчым росце І. Мележа-празаіка. Іван Паўлавіч прызнаваўся, што кніга памятная яму і таму, што «толькі з яе выхадам адчуў сябе пісьменнікам».

Пасля «Мінскага напрамку» І. Мележ апынуўся нібы на ростанях. Цяжкая праца над раманам так знясіліла, што ён адчуваў сябе не ў стане ўзяцца за значную кнігу. Каля трох гадоў не пісаў буйных твораў. Надрукаваў некалькі апавяданняў: «У гарах дажджы» (1954) і «Спатканне за горадам» (1955). Першае з іх, што дало назву аднаму са зборнікаў, напісана на матэрыяле даваеннай службы аўтара ў войску. Апавяданні і аповесці 1950-х гадоў склалі тры зборнікі прозы: «Блізкае і далёкае» (1954), «У гарах дажджы» (1957), «Што ён за чалавек» (1961). Маленькія аповесць — «Дом пад сонцам» (1954), п’есы — «Пакуль вы маладыя» (1955), «Дні нараджэння», «У новым доме» (1957).

Іван Мележ — аўтар цыкла раманаў «Палеская хроніка»: «Людзі на балоце» (1962), «Подых навальніцы» (1966) і «Завеі, снежань» (1976). Раман «Людзі на балоце» ён пачаў як твор лірычны і называў яго «лірычным раманам», а наступныя раманы трылогіі ствараў ужо як трагедыйныя раманы-даследаванні. У іх выявілася грамадзянская смеласць і ідэйна-мастацкая маштабнасць у асэнсаванні складаных абставін калектывізацыі на Палессі, жыцця Беларусі 1920—30-х г., праўдзівасць і шчырасць аўтара ў спалучэнні з яго высокай прафесійнай культурай, глыбокім і тонкім псіхалагізмам, разуменнем душы беларускага селяніна. Непаўторная мастацкая канцэпцыя тагачаснага жыцця народа, вялікі ідэйны змест данесены праз дасканалую мастацкую форму і адметныя вобразы. «Палеская хроніка» — глыбокае філасофска-мастацкае асэнсаванне жыцця беларускага народа на вельмі важным гістарычным этапе, яна стала нацыянальнай эпапеяй.

Напісаў п’есы «Пакуль вы маладыя» (1956, асобнае выданне ў 1958, пастаўлена ў 1957, «Дні нашага нараджэння» (апублікавана і пастаўлена ў 1958), аднаактоўку «Хто прыйшоў уночы» (1959, асобнае выданне ў 1966). Па раманах «Людзі на балоце» і «Подых навальніцы» Беларускім тэлебачаннем створаны ў 1966 г. спектакль. Беларускім тэатрам імя Янкі Купалы пастаўлены ў 1966 г. спекталь «Людзі на балоце», Гомельскім абласным тэатрам — «Подых навальніцы» (1977), у 1989 г. — «Страсці эпохі» (паводле рамана «Завеі, снежань»), Лаўрэат Літаратурнай прэміі імя Якуба Коласа (1962) за раман «Людзі на балоце», Ленінскай прэміі (1972) за раманы «Людзі на балоце» і «Подых навальніцы», Дзяржаўнай прэміі БССР (1976) за кнігу крытычных нарысаў, артыкулаў «Жыццёвыя клопаты» (пасмяротна).

У 1975 Іван Мележ выдаў кнігу літаратурна-крытычных артыкулаў, эсэ, інтэрв’ю і публіцыстыкі «Жыццёвыя клопаты» (Дзяржаўная прэмія Беларусі імя Я. Коласа 1976), у 1977 выйшла «Першая кніга» (дзённікі, запісы ваенных гадоў).

Стыль пісьменніка
Вялікую ролю ў выпрацоўцы мастацкага стылю І. Мележа мела творчая вучоба пісьменніка на лепшых узорах мастацтва слова. Івану Паўлавічу адкрылася простая ісціна, што калі «стыль — гэта чалавек, то каб стыль мастака праявіўся больш выразна, своеасабліва, трэба, каб выразна праявілася асоба чалавека, яго светаадчуванне, погляды, матэрыяльны і духоўны вопыт... Усе загадкі майстэрства залежаць урэшце ад аднаго — ад асобы мастака. Багацце свету, багацце майстэрства пісьменніка — у самой яго асобе. Каб высокае было мастацтва, трэба, каб высокай была асоба творцы».

Ужо раннія творы І. Мележа вызначаліся вернасцю пісьменніка жыццёвай праўдзе, глыбокім псіхалагічным аналізам чалавечых учынкаў, вастрынёй сацыяльнага і духоўнага бачання рэчаіснасці. З самага пачатку для яго былі характэрны эпічная паўната і цэласнасць узнаўлення характараў і абставін. Гэта сведчыла пра тое, што ў літаратуру прыйшоў арыгінальны мастак, які глыбока разумее і любіць чалавека, здольны ярка паказаць яго ўнутраны свет. З часам пашыраліся жанравыя рамкі твораў, а зварот да паказу жыцця любага Палесся надаў стылю аўтара рамана «Людзі на балоце» яшчэ большы лірызм. Асэнсаванне падзей прымусовай калектывізацыі напоўніла твор праўдзівым драматызмам.

У вузкім значэнні пад стылем пісьменніка разумеюць асаблівасці яго мастацкай мовы. І. Мележ прызнаваўся, што ніколі яго не мучыла думка, што пісаць (цікавых задум, жыццёвага матэрыялу хапала), затое «мучыла заўсёды — як пісаць». Яго непакоіла, што піша марудна, адчуваючы «нясмеласць у абыходжанні са словам». Мастак з цеплынёю называў беларускую мову ласкавай, мілагучнай, як песня. «Я чую тое, што пішу, як музыку, з мелодыяй, з рытмам. Бывае, чытаю ўслых напісанае. Востра сачу, каб у мелодыі твора не было фальшу. Ледзь пачую фальш, спыняюся, шукаю дакладныя тоны і словы. Імкнуся знайсці самыя дакладныя». Такое надзвычай беражлівае стаўленне І. Мележа да роднай мовы спрыяла выпрацоўцы самабытнага стылю.

Традыцыі і наватарства
І. Мележ быў не першы, хто пісаў пра Палессе. Але, як сведчаць творы «Алеся» А. Купрына, «Паездка на Палессе» І. Тургенева, «Доўгія гады» К. Паўстоўскага, «Лес шуміць» У. Караленкі, палескі край часта ўспрымаўся пісьменнікамі-«суседзямі» экзатычным, этнічным «ізалятам». І. Мележ здолеў убачыць тое, чаго да яго не бачыў ніхто. Пісьменнік добра разумеў і перадаў паляшуцкую свядомасць, псіхалогію сваіх герояў. А ўвядзенне ў канву «Палескай хронікі» этнаграфічнага матэрыялу дало мажлівасць мастаку дасканала ўзнавіць рэчаіснасць палескай вёскі 1920-х гадоў, адзначыць агульнае — «як ва ўсіх рэгіёнах» — і акрэсліць тыя рысы характару, што робяць палешукоў адметнымі. Плённым аказаўся таксама зварот да фальклору, які выступае ў творы як адна са сфер жыцця народа.

Ствараючы кнігу народную, раскрываючы самабытнасць народнага жыцця і народнага характару, Мележ-мастак абапіраўся на традыцыі сваіх папярэднікаў. Беларуская літаратура шмат сказала пра жыццё селяніна. Гэта вяртанне да асэнсавання тэмы «чалавек і зямля» ў новых гістарычных умовах, не менш пакручастых і драматычных. Больш пільную ўвагу праявіў І. Мележ да ўнутранага свету селяніна-працаўніка, да сацыяльна-этычнай сутнасці чалавечых узаемаадносін. Арыентацыя аўтара «Палескай хронікі» на эпічную традыцыю Кузьмы Чорнага яскрава адчуваецца ва ўзмоцненай увазе да разгорнутых псіхалагічных малюнкаў, выразнасці мастацкай дэталі, майстэрстве раскрыцця дыялектыкі душы герояў, грамадскіх падзей праз лёс чалавека.

Напоўніўшы спрадвечную вясковую тэматыку палескім матэрыялам, І. Мележ здолеў выказаць сваё непаўторнае слова пра чалавека на зямлі. Ён з сучасных пазіцый расказаў пра падзеі 1920-х гадоў, да асэнсавання якіх ужо звярталася літаратура. Наватарства мастака выявілася ў тым, што засяродзіўся ён на драматызме для сялянства паспешлівай і гвалтоўнай калектывізацыі.

Ушанаванне памяці

Скульптурная кампазіцыя «Людзі на балоце» ў Хойніках.
Імем Івана Мележа названы Мазырскі драматычны тэатр, цеплаход, вуліцы ў Мінску, Гомелі, Хойніках, Лельчыцах, Беларуска-славянская гімназія № 36 і гарадская бібліятэка № 2 ў Гомелі, Глінішчанская сярэдняя школа Хойніцкага раёна, у Мінску на доме № 7 па вуліцы Янкі Купалы, у якім жыў народны пісьменнік, усталявана мемарыяльная дошка, у вёсцы Глінішча створаны літаратурны музей і ўсталяваны бюст І. Мележа. У 1980 устаноўлена Літаратурная прэмія Саюза пісьменнікаў Беларусі імя Івана Мележа. У 2010 г. у Хойніках адкрыта скульптурная кампазіцыя «Людзі на балоце». Яго імя носіць вуліца ў Мінску, вуліцы ў іншых гарадах Беларусі.

Жыццю і творчасці пісьменніка прысвечаны дакументальны фільм «Іван Мележ» (сцэнарый В. Адамчыка, 1978). Рэжысёр В. Тураў і аператар Дз. Зайцаў на студыі «Беларусьфільм» паставілі мастацкія кінафільмы «Людзі на балоце» (1981, Дзяржаўная прэмія СССР 1984) і «Подых навальніцы» (1982). У 1984 В. Тураў зняў 8-серыйны тэлефільм.

Тэле- і кінапастаноўкі
Тэлепастаноўкі

Беларускім тэлебачаннем пастаўлены спектакль "Людзі на балоце" (1965, Дзяржаўная прэмія Беларускай ССР, 1966, рэж. А. З. Гутковіч), а таксама телепостановка «Сустрэчы і развітання» (тэлефільм «Завеі, снежань», 1979), «Страсці эпохі» (паводле рамана «Завеі, снежань», 1989).

Беларускім тэатрам імя Янкі Купалы ў 1966 г. пастаўлены спектакль «Людзі на балоце», Гомельскім абласным тэатрам — «Подых навальніцы» (1977), у 1989 г. — «Страсці эпохі» (паводле рамана «Завеі, снежань»).

Фільмаграфія

"Людзі на балоце" (1981, сцэнар В.Ц. Тураў, рэжысёр В.Ц. Тураў, Беларусьфільм) «Подых навальніцы» (1982, сцэнар В.Ц. Тураў, рэжысёр В.Ц. Тураў, Беларусьфільм)

Бібліяграфія
У 1969-1971 гг. Выйшаў збор твораў у 6-ці, у 1979-1985 гг. - у 10 тамах.

Зборнікі апавяданняў

- «У завіруху» (1946);

- «Гарачы жнівень» (1948);

- «Заўсёды наперадзе» (нарыс, 1948);

- «Блізкае і далёкае» (1954);

- «У гарах дажджы» (1957);

- «Што ён за чалавек» (1961);

- «Жыццёвыя клопаты» (1975);

- «Белыя вішні і яблыні» (1976);

- «Першая кніга: Дзённікі, сшыткі, з запісных кніжак» (1977).

Раманы

- «Мінскі напрамак» (1952, перапрацаванае выданне 1974);

- "Палеская хроніка» (трылогія):

- «Людзі на балоце» (1962);

- «Подых навальніцы» (1966);

- «Завеі, снежань» (1978).

П'есы

- «Пакуль вы маладыя» (1956, асобнае выданне ў 1958, пастаноўка 1957);

- «Дні нашага нараджэння» (апублікавана і пастаўлена ў 1958);

- «Хто прыйшоў уночы» (1959, асобнае выданне ў 1966).


Узнагароды і прэміі
Два ордэна Працоўнага Чырвонага Сцяга;
Ордэн Чырвонай Зоркі;
Ордэн «Знак Пашаны»;
Медалямі;
Лаўрэат Літаратурнай прэміі імя Якуба Коласа (1962) за раман «Людзі на балоце»;
Ленінская прэмія (1972) за раманы «Людзі на балоце» і «Подых навальніцы»;
Дзяржаўная прэмія БССР (1976) за кнігу крытычных нарысаў, артыкулаў «Жыццёвыя клопаты» (пасмяротна).
За вялікія дасягненні ў развіцці беларускай савецкай літаратуры ў 1972 годзе яму прысвоена ганаровае званне народнага пісьменніка БССР.

Памяць
У 1980 годзе Саюзам пісьменнікаў Беларускай ССР была заснаваная літаратурная прэмія імя Івана Мележа; У Мінску, Хойніках, Лельчыцах, Гомелі названая вуліца ў гонар Івана Паўлавіча Мележа; У Мінску на доме № 7 па вуліцы Я. Купалы, дзе жыў пісьменнік, устаноўлена мемарыяльная дошка (1978); У Гомелі імем пісьменніка названыя беларуска-славянская Гімназія № 36 і гарадская бібліятэка № 2; У 1983 годзе на радзіме І.П. Мележа ў вёсцы Глінішча адкрыты мемарыяльны музей і ўсталяваны бюст; У Хойніках у 2010 годзе адкрыта скульптурная кампазіцыя "Па старонках твораў Івана Мележа"; Імя Івана Мележа носіць Мазырскі драматычны тэатр; Дакументальны фільм " Іван Мележ "(1977, рэжысёр Ю. Лысятаў, Студыя "Летапіс", Беларусьфільм); Дакументальны фільм " Іван Мележ "(1990, рэжысёр М. Купеева, Студыя "Летапіс", Беларусьфільм).
                    `
                },
                {
                    "Tag" :"Baradulin",
                    "Name" : "Рыгор Іванавіч Барадулін",
                    "RealName" : "Рыгор Іванавіч Барадулін",
                    "Birth" : "24 лютага 1935",
                    "Die" : "2 сакавіка 2014",
                    "Photo" : ["1","2", "3", "4","5"],
                    "Video" : "1",
                    "Bio" : `               

Нарадзіўся ў сям’і Івана Рыгоравіча і Акуліны Андрэеўны Барадуліных на хутары Верасоўка (афіцыйная назва на той час была «Гарадок ІІ Востраў-Сарочынскага сельсавета»), а ў 1937 г. хутар быў ліквідаваны і сям’ю паэта перасялілі ва Ушачы. Дзед паэта па мамінай лініі Андрэй Гальвіньш быў этнічным латышом. Бацька загінуў у 1944 г. падчас ВАВ у партызанскім атрадзе. Пасля вайны Рыгор Барадулін вучыўся ва Ушацкай сярэдняй школе (скончыў у 1954 г.), затым на філалагічным факультэце БДУ (скончыў у 1959 г.).

Працаваў рэдактарам у розных перыядычных выданнях: газеце «Советская Белоруссия», часопісах «Бярозка», «Полымя», а таксама ў выдавецтвах «Беларусь» (з 1969 г.), «Мастацкая літаратура» (з 1972 г.)[6]. Выдавецтву «Мастацкая літаратура» Рыгор Барадулін аддаў больш за дваццаць гадоў, працаваў рэдактарам, затым загадчыкам рэдакцыі. У складзе дзяржаўнай дэлегацыі БССР прымаў удзел у 39-й сесіі Генеральнай Асамблеі ААН (1984 г.).

Рыгор Барадулін быў дзейным чальцом СБП, адным са стваральнікаў і актыўных удзельнікаў Беларускага ПЭН-цэнтра (1989—1999 гг., прэзідэнт з 1990 г., віцэ-прэзідэнт з 1999 г.). З’яўляўся членам Партыі БНФ, членам Сойма БНФ (з 1989 г.). У 1995—1997 гг. быў у кіраўніцтве Беларускага Фонду Сораса.

Быў жанаты з Валянцінай Міхайлаўнай Барадулінай. Дачка Ілона — мастачка, ёсць унучка Дамініка. Калекцыяніраваў сланоў і чарапах. Рыгор Барадулін вызнаваў сябе як уніята[7].

Памёр 2 сакавіка 2014 г. у сваёй кватэры ў Мінску пасля многіх гадоў пакут ад хваробы Паркінсона. Смерць была раптоўная і імгненная. Быў адпеты ў Чырвоным Касцёле 4 сакавіка 2014 г. у грэка-каталіцкім (уніяцкім) і рымска-каталіцкім абрадах[8]. Пахавалі Рыгора Барадуліна ва Ушачах у беларускай народнай вышытай кашулі ў той жа дзень побач з магілай мамы, як таго і жадаў паэт пры жыцці[9]. Запячатванне Магілы зрабіў апостальскі візітатар для грэка-каталікоў Беларусі архімандрыт Сяргей Гаек.

Погляды
Палітычныя
У школе Рыгор Барадулін не з’яўляўся ўдзельнікам піянерскага руху: падчас запісу ў арганізацыю Барадулін збег са школы. Потым пра той факт, што ён не далучыўся да піянерскай арганізацыі, настаўнікі забыліся, таму Рыгор Барадулін гэтак і не стаў піянерам[10]. У юнацтве далучыўся да камсамола, апраўдваючы гэта тым, што інакш не змог бы паступіць у ВНУ[10]. Падчас працоўнай дзейнасці неаднаразова адхіляў прапановы далучэння да шэрагаў КПСС[11].

У канцы 1980-х гадоў, падчас перабудовы і развіцця звязаных з ёю нацыянальна-адраджэнскіх рухаў у рэспубліках СССР, з’яўляўся актыўным удзельнікам грамадскага руху "Беларускі народны фронт «Адраджэньне», потым далучыўся да Партыі БНФ, якая ўтварылася на падмурку гэтага руху[12]. На першых Прэзідэнцкіх выбарах у гісторыі Беларусі (1994 г.) разам з Васілём Быкавым актыўна падтрымліваў Зянона Пазняка[13]. З другой паловы 1990-х і да смерці актыўнага ўдзелу ў палітыцы не прымаў. Называў палітыку «бруднай справай». У інтэрв'ю выказваў рэзкія антыкамуністычныя (пераважна антыбальшавісцкія) погляды.

Рэлігійныя
У дзяцінстве Рыгор Барадулін быў ахрышчаны рымска-каталіцкім святаром[7]. З канца 1980-х гадоў Барадулін адносіць сябе да вернікаў Беларускай Грэка-Каталіцкай Царквы (уніятаў)[7]. Пры гэтым сцвярджае, што пытанне канфесійнай прыналежнасці не з’яўляецца істотным, бо «ўсё-ткі Бог адзін»[7]. 28 чэрвеня 2004 г. разам з архімандрытам Сяргеем Гаекам меў асабістую аўдыенцыю з Папам Рымскім Янам Паўлам ІІ[14]. Актыўна працаваў у жанры духоўнай лірыкі.

Творчасць

Дэбютаваў вершамі ў 1953 г. у газеце «Чырвоная змена»[6]. Нізка вершаў «На зямлі цаліннай» склала асноўны змест першай кнігі «Маладзік над стэпам» (1959 г.). У ранняй творчасці — кнігі лірыкі «Рунець, красаваць, налівацца!» (1961 г.), «Нагбом» (1963 г.), «Неруш» (1966 г.), «Адам і Ева» (1968 г.) — паэт данёс да чытача трываласць асноў народнай маралі і этыкі, пераканаў у таленавітасці беларускага народа, у яго багатай духоўнасці. У паэзіі ён асэнсоўвае асноўны змест эпохі: вайну, убачаную дзіцячымі вачыма, клопат пасляваенных гадоў, сённяшні і заўтрашні дзень планеты. У вершах «Жароўня», «Труба», «Стэарынавая свечка», «Хлебнічак», «Цялушка», «Палата мінёраў», «Скрыпачы» і інш. — старонкі біяграфіі пакалення дзяцей вайны, што вырастаюць да маштабнага асэнсавання трагізму жыцця беларускага народа на акупіраванай тэрыторыі.

Творчасць паэта вызначаецца разнастайнасцю жанраў, вобразна-стылявых сродкаў, яркай метафарычнасцю, тонкім псіхалагізмам, багаццем моўнай палітры. Скарбы вуснай народнай творчасці, засвоеныя з дзяцінства, сталі дабратворнай глебай, на якой прарасла, зарунела непаўторная творчая індывідуальнасць Рыгора Барадуліна. У яго творах адкрываецца жывая крыніца хараства мовы і мудрасці народа, яго традыцый і звычаяў, своеасаблівай натурфіласофіі. Разам з тым народна-паэтычнае ў творчасці Рыгора Барадуліна нельга вылучыць з індывідуальнага. Дзякуючы такому сінтэзу паэту ўдаецца ствараць манументальныя вобразы Маці, Радзімы, Бацькаўшчыны[15].

Многія вобразы ранняй лірыкі нярэдка маюць працяг у пазнейшых творах: зборнікі «Маўчанне перуна» (1986 г.), «Самота паломніцтва» (1990 г.), «Міласэрнасць плахі» (1992 г.), «Евангелле ад Мамы» (1995 г.). У апошніх кнігах узмацняецца гучанне біблейскіх матываў. Паэт нярэдка звяртаецца да жанру малітвы, малітвы за постчарнобыльскае выжыванне і адраджэнне беларускай нацыі. Імкненнем далучыцца да агульначалавечай духоўнай культуры абумоўлены зварот да Бібліі ў «Трыкірыі». У 2005 годзе выйшаў зборнік малітоўнай паэзіі «Ксты». Зборнік «Руны Перуновы» (2006 г.), у які ўвайшла выбраная лірыка, таксама насычаны духоўнымі вершамі.

Аўтар зборнікаў сатырычных і гумарыстычных твораў «Дойны конь» (1965 г.), «Станцыя кальцавання» (1971 г.), «Прынамсі…» (1977 г.), «Амплітуда смеласці» (1983 г.), «Мудрэц са ступаю» (1988 г.) і інш., эпіграм на дзеячаў беларускай літаратуры і мастацтва: альбом «Няўрокам кажучы» (1971 г.), шаржы М. Лісоўскага; «Абразы без абразы» (1985 г.), шаржы К. Куксо. Творы для дзяцей склалі зборнікі «Мех шэрых, мех белых» (1963 г.), «Красавік» (1965 г.), «Экзамен» (1969 г.), «Ай! Не буду! Не хачу!» (1971 г.), «Суровая вымова» (1976 г.), «Што было б тады, калі б?» (1977 г.), «Ці пазяхае бегемот?» (1981 г.), «Азбука не забаўка» (1985 г.), «Індыкала-кудыкала» (1986 г.), «Кобра ў торбе» (1990 г.). Напісаў кнігу літаратурна-крытычных артыкулаў і эсэ «Парастак радка, галінка верша» (1987 г.).

Цалкам плён працы Рыгора Барадуліна складаецца больш чым з 100 выдадзеных зборнікаў паэзіі, крытычных артыкулаў, эсэ, перакладаў. Двойчы выдаваліся зборы выбраных твораў паэта (1984 г., 1996—2002 гг.). Апошні збор напачатку заяўляўся ў пяці тамах, але выйшлі толькі чатыры.

Да 25-годдзя пантыфікату Папы Рымскага Рыгор Барадулін пераклаў на беларускую мову кнігу паэзіі Яна Паўла II «Рымскі трыпціх» і меў магчымасць пабачыцца з пантыфікам на асабістай аўдыенцыі ў Ватыкане 28 чэрвеня 2004 г.

Пераклаў на беларускую мову п’есу «Вей, вятрок!» Яна Райніса (1980 г.), зборнікі твораў «Блакітны звон Грэнады» Гарсія-Лоркі (1975 г.), «Мелодыя каліны» Івана Драча (1981 г.), «Ветраліст» Габрыелы Містраль (1984 г.), «Рубаі» Амара Хаяма (1989 г.); «Слова пра паход Ігараў» (1986 г.), кнігу Яна Паўла II, а таксама асобныя творы Уільяма Шэкспіра, Джорджа Байрана, Пабла Неруды, Нікаласа Гільена, Адама Міцкевіча, Вінцэся Каратынскага, Уладзіслава Бранеўскага, Сяргея Ясеніна, Расула Гамзатава, Сэсара Вальеха і інш.

У 2013 г. выйшаў «Вушацкі словазбор Рыгора Барадуліна», які ўклала Наталля Давыдзенка. Гэта не проста дыялектны слоўнік з радзімы Рыгора Барадуліна — Ушаччыны[16] — гэта па сутнасці поўнае апісанне жывых традыцый цэлага беларускага раёна з асобнай «вушацкай», як кажа Дзядзька Рыгор, культурай. У кнізе сабрана амаль усё: пачынаючы ад традыцыйных «вушацкіх» імёнаў, скончваючы падрабязным апісаннем страў мясцовай кухні, святкавання народных і рэлігійных свят. Адметнаю рысаю кнігі з’яўляецца таксама і поўная адсутнасць цэнзуры, што робіць мову яшчэ больш жывой. Сам паэт казаў, што гэта самая галоўная кніга ўсяго яго жыцця, пісаць якую ён пачаў яшчэ ў дзяцінстве. «Вушацкі словазбор Рыгора Барадуліна» прызнаны лепшай кнігай 2013 г. па версіі газеты «Наша Ніва»[16].

Песні на словы Рыгора Барадуліна напісалі Алесь Камоцкі, І. Барсукоў, Генрых Вагнер, З. Галубіцкая, Яўген Глебаў, У. Журовіч, М. Наско, Дзмітрый Смольскі, М. Хаўхлянцаў і інш.

Мова
Схільнасць да лінгвістыкі праявілася ў Рыгора Барадуліна яшчэ падчас навучання ў беларускамоўнай школе мястэчка Ушачы, якое сам паэт дыялектна называе Вуша́ча (жаночы род). Барадулін быў выдатнікам па нямецкай мове, меў высокія адзнакі па рускай мове і літаратуры. Беларуская мова выклікала ў Барадуліна найбольшую цікаўнасць. У той час Барадулін пачынае цікавіцца творчасцю Максіма Багдановіча[17]. Дакладныя навукі (фізіка, матэматыка) даваліся Барадуліну цяжэй, што ў спалучэнні са здольнасцю да моў і абумовіла яго паступленне на філалагічны факультэт Беларускага дзяржаўнага ўніверсітэта.

Ва ўніверсітэце Рыгор Іванавіч знаёміцца з творчасцю Пімена Панчанкі, Анатоля Вялюгіна, Янкі Купалы, Якуба Коласа (яго паэму «Новая зямля» Барадулін ведаў у маладосці на памяць), Уладзіміра Караткевіча, Міхася Стральцова (ён, як і Рыгор Барадулін, вучыўся на філалагічным факультэце БДУ з 1954 па 1959 гг.) і іншых беларускіх паэтаў, якія аказалі значны ўплыў на фарміраванне паэтычнага стылю Рыгора Барадуліна[18].

З рускіх паэтаў Рыгор Іванавіч знаходзіўся пад уражаннем ад Міхаіла Лермантава, Уладзіміра Маякоўскага, Аляксандра Пушкіна, Аляксандра Грыбаедава, Восіпа Мандэльштама, Андрэя Вазнясенскага і іншых. Аднак найбольшы ўплыў на Барадуліна пакінуў Сяргей Ясенін[19]

Сярод сусветных паэтаў уплыў на Рыгора Барадуліна аказалі Тарас Шаўчэнка, Генрых Гейнэ, Уільям Шэкспір і Амар Хаям («Рубаі» якога былі перакладзеныя Барадуліным на беларускую мову ў 1989 г.).

Сам паэт казаў, што галоўную ролю ў станаўленні яго як літаратара адыграла маці — Акуліна Андрэеўна Барадуліна. Вобраз маці часта сустракаецца ў творчасці Рыгора Барадуліна, асабліва ў наступных кнігах: «Трэба дома бываць часцей» (1993 г.), «Евангелле ад Мамы» (1995 г.), «Сама пайду дарогаю, голас пашлю дуброваю: Песні матчыны з Вушаччыны» (2005 г.), «Навошта» (2009 г.):

"	Усё ідзе ад маці. Мая мама, паўтаруся, была самым вялікім філолагам. Ва ўсялякім разе для мяне. Дзякуючы маме і беларускай мове я нешта напісаў і, можа, яшчэ нешта напішу. Канешне, можна пісаць і на вывучанай мове, але гэта будзе ўжо сурагат. На вывучанай мове можна пісаць дэтэктывы, эротыку, а глыбінную паэзію, глыбінную прозу трэба пісаць толькі на роднай мове, матчынай. […] Яшчэ ў Бібліі сказана: «Напачатку было слова». […] Я сябе адчуваў і адчуваю чаляднікам у беларускай паэзіі. Няма мовы — няма паэта. Я ўсё жыццё абапіраўся на беларускую мову, на яе вушацкі варыянт, таму што ён для мяне самы блізкі, ён нейкі некрануты, першародны па чысціні сваёй. Мова — гэта мая апора.
Тры мяхі дзядзькі Рыгора, альбо Сам-насам з Барадуліным / Сяргей Шапран — Мінск: Логвінаў, 2011. — с. 74-75	"
На працягу ўсяго жыцця Рыгор Барадулін выступаў супраць русіфікацыі беларускага насельніцтва і беларускай мовы ў СССР, негатыўна ўспрымаў спантанны працяг гэтага працэсу ў незалежнай Беларусі, прытрымліваўся ідэі цалкам беларускамоўнай Беларусі:

"	Цяпер чую ў натоўпе беларускую мову дужа рэдка, ці ад старых людзей, ці ад тых, што з вёскі прыехалі. З аднаго боку, гэта сумна, а з іншага — радасна, калі ад моладзі чую, значыць, нейкая перспектыва яшчэ ёсць. […] Хаця паўсюль цяпер ідзе ўдушэнне беларускай мовы — такое ўражанне, што пятлю ўжо накінулі, але не да канца зацягнулі. Іншым часам нават здаецца, што было б лепш, каб мову забаранілі зусім, — можа, тады б пачалася зваротная рэакцыя. Улада зрабіла выгляд, быццам праблемы такой няма. Але няма праблемы — няма і мовы. Такія агрэсіўна-грэблівыя адносіны. […] Маёй звышзадачай, безумоўна, было, каб усе беларусы гаварылі па-беларуску, каб любілі сваю мову, беларускую паэзію, каб беларуская мова гучала шырока. Але гэта такая, як вам сказаць, ружовая мара. […] І мову нашу пакрываюць асфальтам.
Тры мяхі дзядзькі Рыгора, альбо Сам-насам з Барадуліным / Сяргей Шапран — Мінск: Логвінаў, 2011. — с. 47, 75, 78	"
Творы Рыгора Барадуліна вылучаюцца вялікай колькасцю дыялектызмаў і неалагізмаў.

Творы Рыгора Іванавіча выходзяць на розных нормах беларускай мовы: акадэмічнай, класічнай і аўтарскай норме самога паэта (у залежнасці ад выдавецтва)[20][21][22]. Сучасную сітуацыю з адначасовым існаваннем у беларускай мове дзвюх літаратурных нормаў паэт ацэньваў негатыўна, сцвярджаючы, што гэта спрыяе дэкансалідацыі беларускамоўнай часткі насельніцтва Беларусі, якая і гэтак складае меншасць. «Тарашкевіцу» паэт крытыкаваў за наяўнасць граматычных рыс, якія характэрныя для заходнеславянскай, а не ўсходнеславянскай моўнай падгрупы, за дамінаванне ў лексіцы заходнебеларускага дыялекту і за свядомую замену слоў, аднолькавых для рускай і беларускай моў, польскімі аналагамі. «Наркамаўку» — за лексічную русіфікаванасць, значную абмежаванасць у выкарыстанні прыстаўных гукаў, замену традыцыйных назваў беларускіх населеных пунктаў адпеведнікамі найноўшага часу[23]. Рыгор Барадулін выступаў за распрацоўку і афіцыйнае зацверджанне новай версіі беларускага правапісу, пры стварэнні якога былі б улічаны:

Граматыка 1918 г. Браніслава Тарашкевіча і іншыя творы ў галіне, так званага, «класічнага правапісу», або «тарашкевіцы»;
Распрацоўкі ў галіне беларускага мовазнаўства савецкіх часоў (у тым ліку нормы, так званай, «наркамаўкі»);
Усе захаваныя беларускія народныя гаворкі з іх адметнымі асаблівасцямі[24].
Прызнанне

Узнагароджаны ордэнамі Дружбы народаў, Знак Пашаны, латвійскім ордэнам Трох Зорак (атрымаў званне Афіцэра Ордэна (4 ступень) 23 красавіка 1997 г.)[25] , медалем Францыска Скарыны. Ганаровы доктар БДУ і ганаровы грамадзянін Ушацкага раёна. Рыгор Барадулін — апошні беларус, якому надалі званне Народнага паэта (1992 г.). Лаўрэат прэміі Ленінскага камсамола Беларусі (1976 г.) і Дзяржаўнай прэміі імя Янкі Купалы (1976 г.) за зборнік вершаў «Рум» і пераклады Гарсіі Лоркі.

У 2006 г. кандыдатура Барадуліна была сярод намінантаў на Нобелеўскую прэмію ў галіне літаратуры за зборнік вершаў «Ксты».

Ушанаванне
У 1964 г. Уладзімір Караткевіч прысвяціў Рыгору Барадуліну напісаную аповесць «Ладдзя Роспачы» і падарыў яе рукапіс[26].

24 снежня 2017 г. у Мінску, урачыста адкрылі памятную дошку (аўтар скульптар Ігар Засімовіч) на доме, дзе жыў паэт[27].

Бібліяграфія
Зборнікі паэзіі
Маладзік над стэпам. Мн., 1959 (перавыд. 2010, Мінск);
Рунець, красаваць, налівацца! Мн., 1961;
Мех шэрых, мех белых. Мн., 1963;
Нагбом. Мн., 1963;
Дойны конь. Мн., 1965;
Красавік. Мн., 1965;
Неруш. Мн., 1966;
Адам і Ева. Мн., 1968;
Лінія перамены дат. Мн., 1969;
Экзамен. Мн., 1969;
Ай! Не буду! Не хачу! Мн., 1971;
Вяртанне ў першы снег. Мн., 1972;
Журавінка. Мн., 1973;
Рум. Мн., 1974;
Свята пчалы. Мн., 1975;
Суровая вымова. Мн., 1976;
Прынамсі… Мн., 1977;
Што было б тады, калі б? Мн., 1977;
Абсяг. Мн., 1978;
Белая яблыня грому. Мн., 1979;
Вечалле. Мн., 1980;
Ці пазяхае бегемот? Мн., 1981;
Паэма прызнання. Мн., 1982;
Амплітуда смеласці. Мн., 1983;
Выбраныя творы: У 2 т. Мн., 1984;
Абразы без абразы. Мн., 1985;
Азбука не забаўка. Мн., 1985;
Індыкала-кудыкала. МН., 1986;
Маўчанне Перуна. Мн., 1986;
Парастак радка, галінка верша: Артыкулы, эсэ. Мн., 1987;
Бервенізацыя. Мн., 1988;
Мудрэц са ступаю. Мн., 1988;
Вяртанне. Разам з В. Ждановічам. Мн., 1988;
Кобра ў торбе. Мн., 1989;
Самота паломніцтва. Мн., 1990;
Міласэрнасць плахі. Мн., 1992;
Трэба дома бываць часцей. Мн., 1993;
Азбука — вясёлы вулей. Мн., 1994;
Асобы рознай пробы. Мн., 1994;
Евангелле ад Мамы. Мн., 1995;
Аратай, які пасвіць аблокі: Эсэ і некананізаваныя ўспаміны. Мн., 1995;
Слаўлю чысты абрус. Мн., 1996;
Грышка, Мішка і Шчыпай ехалі на чоўне. Мн., 1996;
Здубавецце. Мн., 1996;
Збор твораў: У 4 т. Мн., «Мастацкая літаратура»: т. І — 1996, т. ІІ — 1998, т. ІІІ — 1999, т. IV — 2002;
Ішоў коця па канапе. Мн., 1997;
Як воўк калядаваў. Мн., 2000;
Лісты ў Хельсінкі. Мн., 2000;
Зорка спагады. Мн., 2000;
Босая зорка. Мн., 2001;
Калі рукаюцца душы: Паэзія з прозай. З Васілём Быкавым. Мн., 2003;
Дуліна ад Барадуліна. Радыё Свабодная Еўропа. Радыё Свабода, 2004;
Сама пайду дарогаю, голас пашлю дуброваю: Песні матчыны з Вушаччыны. Мн., 2005;
Ксты. Мн., 2005;
Ксты/Ksty. Мн., 2006;
Быць!/To Be! Мн., 2006;
Рымскі дыптых. Полацк, 2006;
Рымскі трыпціх. Роздумы. Полацк, 2006;
Руны Перуновы. Мн., 2006;
Ксты. Выданне другое, дапоўненае. Мн., 2006;
Ксты/Ksty. Выданне другое, дапоўненае. Мн., 2007;
Выбраныя творы. Беларускі кнігазбор. Мн., 2008;
Выпаў грук у грома з рук. Мн., 2009;
Навошта. Мн., 2009;
Ксты. Выданне трэцяе, дапоўненае. Мн., 2009;
Халодная памяць вады. Мн., 2010;
Перакуленае/Опрокинутое. М., 2010;
«Вяльмуе Бог абраннікаў сваіх». Полацк, 2011;
Толькі б яўрэі былі!.. Мн., 2011;
Anima. Мн., 2011;
Сябры. Мн., 2013;
Лепей: Рукапісы 1952—2013. Мн., 2013.
                    `
                }
            ]
        }
    }
    render() {
        return (
            <div className = "AuthorCard">
                <p className = "AuthorCard_header">{"Імя :" + this.state.authorsData[this.props.AuthorNum].Name }</p>
                <p className = "AuthorCard_Birth">{ "Нарадзіўся "+this.state.authorsData[this.props.AuthorNum].Birth }</p>
                <p className = "AuthorCard_Die">{ "Памёр "+this.state.authorsData[this.props.AuthorNum].Die }</p>
                <p className = "AuthorCard_Real">{ "Сапраўднае імя:" +this.state.authorsData[this.props.AuthorNum].RealName }</p>                
                <div className = "AuthorCard_Bio">{ this.state.authorsData[this.props.AuthorNum].Bio }</div>
                <div 
                    className = "AuthorCard_photo">
                        <img
                            className = "AuthorCard_photo_img"
                            src = {"/author/"+this.state.authorsData[this.props.AuthorNum].Tag+"/photo/1.jpg"}>
                        </img>
                        <button 
                            className = "AuthorCard_photo_but"
                            onClick = { ()=> this.props.ShowSlideShow( 
                                    this.state.authorsData[this.props.AuthorNum].Photo,
                                    this.state.authorsData[this.props.AuthorNum].Tag
                            )}>Усе фота</button>
                    </div>
                <video
                    className = "AuthorCard_video"
                    width = "200px"
                    height = "150px" 
                    src = {"/author/"+this.state.authorsData[this.props.AuthorNum].Tag +"/video/1.webm"}
                    controls/>
            <p>{ this.state.authorsData[this.props.AuthorNum].bio}</p>

                <button
                    className = "AuthorCard_back"
                    onClick = { ()=> this.props.BackToMainMenu() }>
                    Вярнуцца да галоўнага меню
                </button>
            </div>
        )
    }
}


const mapState = ( state ) => ({
    AuthorNum : state.numb
})
const mapDispatch = dispatch => {
    return {       
        BackToMainMenu : () => dispatch ({ type : "MAIN_MENU"}),    
        ShowSlideShow : (arr, tag) => dispatch ({ type : "SHOW_SLIDESHOW", photoArr : arr, Tag : tag}) 
    }
}

export default connect(mapState, mapDispatch) (AuthorCard);