import React from 'react';
import './LingvMenu.css';

import { connect } from 'react-redux';

class LingvMenu extends React.Component {
    constructor ( props ) {
        super (props);
        this.state = {
            LingvList : [
                "Апытванне 5 кл Марфалогія, члены ск",
                "Апытванне Дзеяслоў 7 кл",
                "Апытванне Залік 6,7 клас",
                "Апытванне Паўтарэнне вывучанага ў 4 кл. (5 kл)",
                "Апытванне Фанетыка",
                "Апытванне Члены сказа Простая мова 5 кл",
                "Апытванне Што такое дзеепрыметнік",
                "Картка 7 кл. Часціцы",
                "Картка 8 КЛ",
                "Картка Cкладаныя сказы і аднародныя 7 кл",
                "Картка Cкласці тэкст 2",
                "Картка Адасобленыя члены сказа",
                "Картка Аднародныя члены сказа",
                "Картка Аднародныя члены сказа 5 кл ТАБЛ",
                "Картка Антонімы",
                "Картка Арфаграфія 5 КЛ",
                "Картка БСС і простыя(заданне)",
                "Картка Бяззлучн. ск",
                "Картка Бяззлучнікавыя сказы 9 кл",
                "Картка Выклічнік",
                "Картка Дапаўненне (прамое і ўскоснае)",
                "Картка Дзеясловы 5 кл (работа ў гр.)",
                "Картка Заданні 10 клас",
                "Картка Займеннік",
                "Картка Знайсці і выпісаць дзеясловы 5 кл",
                "Картка Знакі прыпынку пры дзеепрыметн",
                "Картка Знакі прыпынку ў склад. сказах 5 кл",
                "Картка Знакі прыпынку ў складаных сказах",
                "Картка Каардынацыя дзейніка і выказніка",
                "Картка Камбинаванай б. + складаназалеж",
                "Картка Канчаткі назоўнік",
                "Картка Лексіка",
                "Картка Лексіка. Агульнае",
                "Картка Лексікалогія",
                "Картка Марфалогія",
                "Картка Марфалогія 6 кл",
                "Картка Непадзельн.словазлуч.",
                "Картка Носьбіт",
                "Картка Пабочныя канструкцыі, зваротак 8 кл",
                "Картка Пабочныя словы (работа ў групах)",
                "Картка Падаўжэнне падваенне  5 кл",
                "Картка Правапіс ь",
                "Картка Правапіс ь 10 кл",
                "Картка Простая мова 9 кл",
                "Картка Прыказкі 5 кл",
                "Картка Прыназоўнікі",
                "Картка Прыстаўн. гукі (картка 2)",
                "Картка Прыстаўн. гукі(картка 3)",
                "Картка Прыстаўныя гукі (картка1)",
                "Картка Разрады злучнікаў",
                "Картка Сказы па мэце выказвання",
                "Картка Складаназалежныя ск.",
                "Картка Складаназалежныя сказ 11 кл.",
                "Картка Складаназалежныя сказы",
                "Картка Складаназалежныя сказы 9 кл",
                "Картка Складаназалежныя СКАЗЫ для АД",
                "Картка Складаназлучаны сказ 9 кл",
                "Картка Складаныя сказы",
                "Картка Складаныя сказы 9 кл ЗАЛІК",
                "Картка Скласці тэкст",
                "Картка Словазл. фразеал. перакл",
                "Картка Словазлучэнне. 5 клас",
                "Картка Словазлучэнне. Сказ. 8 клас",
                "Картка Слоўнікавы дыктант",
                "Картка Ступені параўнання прыслоўяў",
                "Картка Сінтаксіс",
                "Картка Сінтаксіс+простая мова",
                "Картка Сінтаксіс 8 кл. выніковы",
                "Картка Сінтаксічная роля дзеяслова",
                "Картка Сінтаксічны разбор сказа+пераклад",
                "Картка ТЭКСТ",
                "Картка Тэкст. Выправіць памылкі",
                "Картка ТЭКСТ 5 КЛАС",
                "Картка Фанетычныя змены",
                "Картка Фразеалагізмы",
                "Картка Фразеалагізмы (работа ў групах) 5 кл",
                "Картка Члены сказа 5-6 КЛ",
                "Карткі 5 клас Аднародныя члены",
                "Карткі Адасабленні 11 клас",
                "Карткі для 5 класа",
                "КАРЦІНКІ ДЛЯ КАРТАК",
                "Лексіка Антонімы  Амонімы Сінонімы",
                "Малюнкі грыбоў",
                "Марфалогія Лічэбнікі",
                "Марфалогія Назоўнік",
                "Марфалогія Назоўнікі адушаўленыя",
                "Марфалогія Прыметнік",
                "Марфалогія Службовыя часціны мовы",
                "Марфеміка (табліца) 5 кл",
                "Марфеміка Для табліцы",
                "Пабочныя сказы (карткі)",
                "Пераказ  6 клас Крыница",
                "Пераказ 6 клас Миколка",
                "Пераказ 8 кл Сведкі даўніны (заданні)",
                "Пераказ 9 кл Дадатковае заданне",
                "Пераказ 10 клас Сяброўства з бабром",
                "Пераклад В орешнике на берегу 5 кл",
                "Пераклады Гульня ў настаўніка",
                "Пераклады Здравствуйте",
                "Пераклады Осень 6 клас",
                "Пераклады Сложносочиненное предложение",
                "Словы для завучвання на памяць",
                "Слоўнікавыя дыктанты 6-10 клас",
                "СІМВАЛЫ"
            ]            
        }
    }
    renderLinkList () {
        let i = 0;
        let x = [];
        this.state.LingvList.forEach(element => {
            x.push (
                <li>
                <a
                    className = "LingvMenu_el"
                    id = {i}
                    onClick = {() => { this.props.ShowPDF( element ) }}
                    >
                    {element}
                </a>
                </li>)
        i += 1;
        });
        return x;
    }
    render() {
        return (
            <div className = "LingvMenu">           
            <ul className = "LingvMenu_older">
                { this.renderLinkList() }
                </ul>     
                
                <button
                    className = "LingvMenu_but"
                    onClick = { ()=> this.props.BackToMainMenu() }>
                    Вярнуцца да галоўнага меню
                </button>
            </div>
        )
    }
}

const mapState = ( state ) => {

}
const mapDispatch = dispatch => {
    return {
         ShowPDF : ( ff ) => dispatch({ type : "SHOW_PDF", sub: 'lingv' , fileName : ff, owner: 'LingvMenu'}),
         BackToMainMenu : () => dispatch ({ type : "MAIN_MENU"})        
    }
}

export default connect(mapState, mapDispatch) (LingvMenu);